[
    {
        "Job Title": ".NET Multi-platform App UI tracker app development(MAUI)",
        "Employer Name": "No Employer Name Available",
        "Budget": "₹350-650 INR / hour",
        "Proposal": "7 proposals",
        "Client_Location": "Vienna,  Austria",
        "Job Description": "I am looking for a talented app developer with extensive experience in .NET Multi-platform App UI, to create a tracker application compatible with Windows and MacOS. \n\nKey requirements include:\n- Proficiency in .NET Multi-platform App UI\n- Experience in developing cross-platform applications\n- Knowledge in implementing user authentication systems\n\nFeatures of app are \n- Start/Stop timer\n- Taking screenshots at intervals\n- Low activity alerts(ideal alerts)\n\nyou can write maui at beginning so we know we read this\n\nThe application will require a user authentication system based on a username and password and also MS auth to login. Therefore, the ideal candidate should have experience in creating secure and user-friendly login interfaces."
    },
    {
        "Job Title": "Rive Animations for Website",
        "Employer Name": "No Employer Name Available",
        "Budget": "€30-250 EUR",
        "Proposal": "32 proposals",
        "Client_Location": "Courbevoie,  France",
        "Job Description": "I'm looking for an animation designer to create 23 animations for our website. But we don't have a big budget (startup pre-launch)\n\nSome are very complicated, others very simple:\n-1 Complex\n- 2 less complex\n- 1 suite of 5 moderately complex animations (for pricing)\n- 2 simple animations\n- 3 very simple animations\n- 2 loading animations (1 simple / 1 more complex)\n- & 8 animated icons\n\nLink of the Figma to have an idea : [login to view URL]\n\nI've contacted several designers, including yourself, and would like to receive :\n- a quote for the whole project\n- An estimation for the simple loader (to start the collaboration)\n- And an estimate of development time\n\nSo that I can compare you and make my decision.\n\nThank you"
    },
    {
        "Job Title": "Urgent: Modern Minimalist Portfolio Website",
        "Employer Name": "No Employer Name Available",
        "Budget": "$15-25 USD / hour",
        "Proposal": "118 proposals",
        "Client_Location": "George Town,  Malaysia",
        "Job Description": "I'm in a bit of a financial crunch and urgently need a modern, minimalist portfolio website to showcase my work. The sooner I can get this up and running, the better. \n\nKey requirements:\n- Website should be minimalist yet modern, easy to navigate, and visually appealing.\n- Should effectively showcase a portfolio.\n- Need for quick turnaround.\n\nIdeal skills for the job:\n- Experienced in website development, particularly for portfolio sites.\n- Strong understanding of modern minimalist design principles.\n- Ability to deliver high-quality work under tight deadlines."
    },
    {
        "Job Title": "Daily Excel Update from CSV Files",
        "Employer Name": "No Employer Name Available",
        "Budget": "₹1500-12500 INR",
        "Proposal": "5 proposals",
        "Client_Location": "Lauriya,  India",
        "Job Description": "I need help with my daily data management task. Each day, I receive a new CSV file containing updates and new records that need to be added to my existing Excel file.\n\nKey requirements:\n- Add new records from the CSV to the Excel\n- Identify new records in the CSV by unique ID\n\nIdeal skills include:\n- Proficiency in Excel\n- Experience with CSV files\n- Attention to detail\n- Ability to handle daily tasks consistently and efficiently\n\nThis project requires updating an Excel sheet with data from a CSV file on a daily basis. It’s crucial that new records are correctly identified by their unique IDs to ensure the integrity of the data."
    },
    {
        "Job Title": "Wildlife Tour Ticketing Automation",
        "Employer Name": "No Employer Name Available",
        "Budget": "₹12500-37500 INR",
        "Proposal": "12 proposals",
        "Client_Location": "Jaipur,  India",
        "Job Description": "I am a wildlife tour organizer in India and I need help in automating ticket bookings on my website. The primary focus will be to streamline the ticket purchase process. \n\nKey Requirements:\n- Automation of the ticket purchase process on my wildlife ticket booking website\n- Integration of secure payment gateways supporting Credit/Debit cards and Bank transfers\n\nIdeal Skills and Experience:\n- Proficient in web app development\n- Experience with e-commerce and ticketing platforms\n- Knowledge of integrating various payment methods\n- Ability to create user-friendly, efficient and secure web apps"
    },
    {
        "Job Title": "App ios androidncar parts sales",
        "Employer Name": "No Employer Name Available",
        "Budget": "€30-250 EUR",
        "Proposal": "72 proposals",
        "Client_Location": "Valenca,  Portugal",
        "Job Description": "Good morning\nI want to create an app to sell car parts.Ios+[login to view URL] already have the site built.I want an app on google play and the app store.I ask you to send me the link with the app template along with the proposals.I will also only consider proposals with real and objective prices.I want the app published in the respective stores\nSerious people only\nThe project is urgent.\nThank you"
    },
    {
        "Job Title": "Power BI Expert Needed for Asset Analysis",
        "Employer Name": "No Employer Name Available",
        "Budget": "$30-250 USD",
        "Proposal": "21 proposals",
        "Client_Location": "Dubai,  United Arab Emirates",
        "Job Description": "I'm seeking a Power BI expert who can assist me in queries and table creation. I'm currently pulling IT asset data from various APIs, specifically related to systems and laptops.\n\nKey Responsibilities:\n- Assist with merging data from multiple sources\n- Help with comparison and adding new columns\n- Create Power BI dashboards that primarily focus on tracking inventory and availability \n\nIdeal Skills & Experience:\n- Proficient in Power BI\n- Experience with data from APIs\n- Skilled in data merging, comparison, and transformation\n- Ability to create insightful dashboards for asset tracking"
    },
    {
        "Job Title": "No Title Available",
        "Employer Name": "No Employer Name Available",
        "Budget": "Not Disclosed",
        "Proposal": "No Location Available",
        "Client_Location": "No Location Available",
        "Job Description": "No Description Available"
    },
    {
        "Job Title": "Modern Aesthetic Revamp for ShrewdLearn",
        "Employer Name": "No Employer Name Available",
        "Budget": "₹600-1500 INR",
        "Proposal": "5 proposals",
        "Client_Location": "Bengaluru,  India",
        "Job Description": "I'm looking for a talented web designer to give my website, [login to view URL], a modern and trendy facelift. This site was originally created by AI and is currently hosted on Hostinger. The goal of this redesign is primarily to improve the aesthetics of the site, making it more visually appealing and in line with contemporary design trends.\n\nKey Requirements:\n- A modern/trendy design style: The redesign should reflect a sleek, up-to-date aesthetic that captures attention and holds interest.\n- Use of high-quality images: The new design should incorporate high-resolution images, enhancing the visual appeal and professionalism of the site.\n- Implementation of a vibrant color scheme: The use of a lively, engaging color palette is crucial to the redesign. The colors should be well-coordinated and contribute to a cohesive overall look.\n- Smooth user experience: While the primary focus is on aesthetics, the site should also be user-friendly, with intuitive navigation and a seamless browsing experience.\n- Future flexibility: The redesigned site should be easy to update in the future, allowing for the addition of banners and new pages as needed.\n\nIdeal candidates for this project should have:\n- A strong portfolio of modern web design\n- Experience with user interface/user experience (UI/UX) design\n- Proficiency in working with high-quality images and vibrant color schemes\n- Knowledge of how to create flexible, easily updatable websites \n\nI look forward to seeing your proposals and discussing how we can enhance the visual appeal and user engagement of my site."
    },
    {
        "Job Title": "Indonesian Language Translations - Ambonese Malay 2",
        "Employer Name": "No Employer Name Available",
        "Budget": "$15-25 USD / hour",
        "Proposal": "3 proposals",
        "Client_Location": "Plano,  United States",
        "Job Description": "I am in need of translation services from Indonesian into Ambonese Malay\n\nIdeal Skills:\n- Fluent in both Indonesian and Ambonese Malay\n- Exceptional translation skills\n- Experience with formal, academic or professional content\n- Familiarity with potential cultural nuances and ability to convey these in the translation"
    },
    {
        "Job Title": "Social Networking App Development",
        "Employer Name": "No Employer Name Available",
        "Budget": "£18-36 GBP / hour",
        "Proposal": "3 proposals",
        "Client_Location": "Maidenhead,  United Kingdom",
        "Job Description": "I'm embarking on a new venture and need a seasoned app developer to help bring my idea to life. This will be a social networking app with the following features:\n\n- User profiles and connections: Users should be able to create profiles, connect with friends, and build their own network.\n- Messaging and chat functionality: The app will need a robust, real-time messaging system for user interactions.\n- Content sharing and feed: Users should be able to share content and have a personalized feed based on their connections.\n\nThe app will need to be developed for both iOS and Android. Experience with cross-platform mobile app development is highly desirable. Please include examples of any similar projects you've completed in your bid."
    },
    {
        "Job Title": "PDF to Editable Canva Doc Conversion",
        "Employer Name": "No Employer Name Available",
        "Budget": "£10-20 GBP",
        "Proposal": "48 proposals",
        "Client_Location": "Chesterfield,  United Kingdom",
        "Job Description": "I need a professional to convert my PDF into an editable Canva document. The project includes:\n\n- Making the text and images from the PDF editable in Canva.\n- Preserving all text styles (fonts, sizes, colors) from the PDF in the Canva doc.\n\nI want the attached PDF to be recreated in Canva - once done, I will inform the designer of which areas need to be 'locked down' so they are un-editable apart from by me"
    },
    {
        "Job Title": "No Title Available",
        "Employer Name": "No Employer Name Available",
        "Budget": "Not Disclosed",
        "Proposal": "No Location Available",
        "Client_Location": "No Location Available",
        "Job Description": "No Description Available"
    },
    {
        "Job Title": "Financial Data Analysis in Excel",
        "Employer Name": "No Employer Name Available",
        "Budget": "$10-30 AUD",
        "Proposal": "31 proposals",
        "Client_Location": "Perth,  Australia",
        "Job Description": "I'm looking for a skilled Excel professional who can assist me in analyzing my financial data. The main goal of this project is to generate comprehensive summary reports that can provide insights about my financial situation. \n\nKey Tasks:\n- Conduct thorough analysis of my financial data using Excel\n- Generate clear and concise summary reports based on the analysis\n\nIdeal Skills and Experience:\n- Proficient in Excel, with a strong emphasis on data analysis\n- Experience working with financial data\n- Excellent report writing skills, with the ability to present complex data in a clear and understandable manner.\n\n\n\njust 3 pages report"
    },
    {
        "Job Title": "No Title Available",
        "Employer Name": "No Employer Name Available",
        "Budget": "Not Disclosed",
        "Proposal": "No Location Available",
        "Client_Location": "No Location Available",
        "Job Description": "No Description Available"
    },
    {
        "Job Title": "Real Estate Salespersons Needed in India",
        "Employer Name": "No Employer Name Available",
        "Budget": "₹250000-500000 INR",
        "Proposal": "Open for bidding",
        "Client_Location": "Delhi,  India",
        "Job Description": "We are seeking experienced freelancers to act as real estate salespersons for our fresh commercial and residential projects in Noida, Delhi, and Ghaziabad. \n\nKey Responsibilities:\n- Engage in various sales activities, primarily tailored to the individual's strengths and compatibilities. These may include:\n  - Cold calling\n  - In-person meetings\n  - Hosting open houses\n- Focus on both commercial and residential properties\n\nIdeal Candidate:\n- Proven experience in direct sales, preferably in the real estate sector\n- Exceptional communication and interpersonal skills\n- Ability to adapt to various sales activities\n- Familiarity with the Noida, Delhi, and Ghaziabad real estate market is a plus."
    },
    {
        "Job Title": "Event Footage Video Editing",
        "Employer Name": "No Employer Name Available",
        "Budget": "₹100-400 INR / hour",
        "Proposal": "4 proposals",
        "Client_Location": "Nashik,  India",
        "Job Description": "I'm in need of a professional video editor to assist with editing my event footage. The primary focus will be on color correction to enhance the visual quality of the video. \n\nIdeal skills and experience for the job:\n- Proficient in video editing software, particularly for color correction\n- Experience with editing event footage\n- Ability to enhance the overall visual quality of the video\n\nLooking forward to seeing your bids."
    },
    {
        "Job Title": "Facebook ads",
        "Employer Name": "No Employer Name Available",
        "Budget": "₹12500-37500 INR",
        "Proposal": "17 proposals",
        "Client_Location": "Theethampatti,  India",
        "Job Description": "I'm embarking on an exciting journey with IDP to develop a new product. The project is open-ended and I am looking for freelancers who are skilled in product development and can contribute innovative ideas and solutions."
    },
    {
        "Job Title": "I need a kotlin android developer who knows firebase backend",
        "Employer Name": "No Employer Name Available",
        "Budget": "₹600-601 INR",
        "Proposal": "4 proposals",
        "Client_Location": "Kota,  India",
        "Job Description": "You don't have to write the code. I will give you the code and you have to just place it and create the APK\n\nYou will also need to setup firebase backend for the app."
    },
    {
        "Job Title": "Indonesian Language Translations LampungNyo 2",
        "Employer Name": "No Employer Name Available",
        "Budget": "$15-25 USD / hour",
        "Proposal": "Open for bidding",
        "Client_Location": "Plano,  United States",
        "Job Description": "I am in need of translation services from Indonesian into LampungNyo .\n\nIdeal Skills:\n- Fluent in both Indonesian and LampungNyo \n- Exceptional translation skills\n- Experience with formal, academic or professional content\n- Familiarity with potential cultural nuances and ability to convey these in the translation"
    },
    {
        "Job Title": "No Title Available",
        "Employer Name": "No Employer Name Available",
        "Budget": "Not Disclosed",
        "Proposal": "No Location Available",
        "Client_Location": "No Location Available",
        "Job Description": "No Description Available"
    },
    {
        "Job Title": "Flexible WooCommerce Subscription Implementation",
        "Employer Name": "No Employer Name Available",
        "Budget": "₹1500-12500 INR",
        "Proposal": "33 proposals",
        "Client_Location": "Bengaluru,  India",
        "Job Description": "I would like to implement a subscription management and auto-renewal feature that operates as follows:\n\nWe have integrated custom start and end date picker on cart page so subscription logic should be implemented using those fields\n\nAuto-Renewal and Cancellation: If a subscription reaches its end date and the user has not renewed it, the subscription status should automatically change to \"canceled.\" The associated stock should then be returned to the inventory, making it available for others to purchase. They should also get reminders 7 days and 1 day prior renewal asking for renewal.\n\nAdmin Order Page Enhancements: On the admin side, the start and end dates for each subscription should be visible on the order page for better tracking and management.\n\nUser Account Dashboard Features: In the user's WooCommerce \"My Account\" dashboard, the following options should be available:\n\nManage Subscription: Users can view and manage their active subscriptions.\n\nView Start and End Dates: Users can check the start and end dates of their subscriptions.\n\nAuto-Renewal Settings: Users can enable or disable the auto-renewal feature for their subscriptions.\n\nCancel Subscription Option: Users can choose to cancel their subscription, which will set it to automatically cancel on the end date."
    },
    {
        "Job Title": "No Title Available",
        "Employer Name": "No Employer Name Available",
        "Budget": "Not Disclosed",
        "Proposal": "No Location Available",
        "Client_Location": "No Location Available",
        "Job Description": "No Description Available"
    },
    {
        "Job Title": "Business Development Associate for E-commerce",
        "Employer Name": "No Employer Name Available",
        "Budget": "₹1500-12500 INR",
        "Proposal": "2 proposals",
        "Client_Location": "Ahmedabad,  India",
        "Job Description": "I'm looking for an experienced Business Development Associate to drive lead conversion in the E-commerce sector. You will be primarily working with cold leads, so your ability to reach out, establish rapport, and ultimately close deals will be crucial. \n\nKey Responsibilities:\n- Convert generated leads into customers through effective communication and negotiation\n- Utilize CRM software for tracking, management and follow-up of leads\n- Meet and exceed sales targets\n- IVR calling\n\nSkills and Experience:\n- Proven experience in sales, preferably within the E-commerce industry\n- Exceptional communication and negotiation skills\n- Proficiency in CRM software\n- Ability to work independently and as part of a team\n\n- Must Be INDIAN"
    }
]