[
    {
        "Job Title": "IT Operations Project Manager  in  FRANCE",
        "Company Name": "Cloud Visa Immigration LLP",
        "Location": "Delhi",
        "Salary": "Rs 46  - 50 Lakh/Yr",
        "Experience": "6 to 11 Yrs",
        "Job Description": "The IT Operations Project Manager is responsible for planning, executing, and overseeing IT operations projects to ensure they are completed on time, within scope, and within budget. | This role involves managing project teams, coordinating with various stakeholders, and ensuring the seamless delivery of IT solutions and services that meet organizational objectives. | Develop detailed project plans, including scope, timeline, resources, and budget. | Coordinate and manage all project activities, ensuring adherence to project schedules and milestones. | Allocate and manage resources effectively, including personnel, technology, and budget. | Work with procurement teams to acquire necessary tools, equipment, and services. | Implement quality control processes to ensure that project deliverables meet established standards and requirements. | Conduct project reviews and assessments to evaluate performance and identify areas for improvement."
    },
    {
        "Job Title": "Urgent requirement for Account Manager - IT Recruitment Consulting Firm",
        "Company Name": "Shell Info Technologies Pvt. Ltd.",
        "Location": "Hyderabad",
        "Salary": "Not Disclosed",
        "Experience": "6 to 8 Yrs",
        "Job Description": "We are seeking a dynamic and experienced Account Manager to join our IT recruitment consulting firm. The ideal candidate will have a proven track record in managing client accounts within the IT industry and driving business growth through effective relationship management and recruitment strategies.Responsibilities:1. Develop and maintain strong relationships with existing clients in the IT sector.2. Identify new business opportunities and expand the client base through networking and referrals.3. Collaborate with the recruitment team to understand client requirements and deliver high-quality candidates.4. Act as a strategic partner to clients, providing insights on market trends, talent acquisition strategies, and industry best practices. 5. Ensure client satisfaction by providing exceptional service and resolving any issues in a timely manner.6. Stay updated on industry trends, competitor activities, and market developments to inform business strategies.Requirements:1.Hands on experience with Deloitte consulting client2. Bachelor's degree or related field.3.Proven experience as an Account Manager in the Domestic IT staffing industry.4. Strong understanding of IT roles, technologies, and market trends.5. Excellent communication, negotiation, and presentation skills.6. Ability to build and maintain long-term client relationships.7. Results-driven with a focus on achieving targets and business objectives.8. Knowledge of recruitment tools and techniques.9. Ability to work independently and as part of a team in a fast-paced environment.10.Immediate joiners preferred.If you meet the above requirements and are passionate about driving business growth in the IT recruitment sector, we would love to hear from you. Please submit your resume to [hidden_email].We look forward to welcoming a talented Account Manager to our team! | We are seeking a dynamic and experienced Account Manager to join our IT recruitment consulting firm. The ideal candidate will have a proven track record in managing client accounts within the IT industry and driving business growth through effective relationship management and recruitment strategies. | We are seeking a dynamic and experienced Account Manager to join our IT recruitment consulting firm. The ideal candidate will have a proven track record in managing client accounts within the IT industry and driving business growth through effective relationship management and recruitment strategies. | Responsibilities: | Responsibilities: | 1. Develop and maintain strong relationships with existing clients in the IT sector. | 1. Develop and maintain strong relationships with existing clients in the IT sector. | 2. Identify new business opportunities and expand the client base through networking and referrals. | 2. Identify new business opportunities and expand the client base through networking and referrals. | 3. Collaborate with the recruitment team to understand client requirements and deliver high-quality candidates. | 3. Collaborate with the recruitment team to understand client requirements and deliver high-quality candidates. | 4. Act as a strategic partner to clients, providing insights on market trends, talent acquisition strategies, and industry best practices. 5. Ensure client satisfaction by providing exceptional service and resolving any issues in a timely manner. | 4. Act as a strategic partner to clients, providing insights on market trends, talent acquisition strategies, and industry best practices. 5. Ensure client satisfaction by providing exceptional service and resolving any issues in a timely manner. | 6. Stay updated on industry trends, competitor activities, and market developments to inform business strategies. | 6. Stay updated on industry trends, competitor activities, and market developments to inform business strategies. | Requirements: | Requirements: | 1.Hands on experience with Deloitte consulting client | 1.Hands on experience with Deloitte consulting client | . | Hands on experience with Deloitte consulting client | Hands on experience with Deloitte consulting client | 2. Bachelor's degree or related field. | 2. Bachelor's degree or related field. | 3 | 3 | . | . | Proven experience as an Account Manager in the Domestic IT staffing industry | Proven experience as an Account Manager in the Domestic IT staffing industry | . | . | 4. Strong understanding of IT roles, technologies, and market trends. | 4. Strong understanding of IT roles, technologies, and market trends. | 5. Excellent communication, negotiation, and presentation skills. | 5. Excellent communication, negotiation, and presentation skills. | 6. Ability to build and maintain long-term client relationships. | 6. Ability to build and maintain long-term client relationships. | 7. Results-driven with a focus on achieving targets and business objectives. | 7. Results-driven with a focus on achieving targets and business objectives. | 8. Knowledge of recruitment tools and techniques. | 8. Knowledge of recruitment tools and techniques. | 9. Ability to work independently and as part of a team in a fast-paced environment. | 9. Ability to work independently and as part of a team in a fast-paced environment. | 10.Immediate joiners preferred. | 10.Immediate joiners preferred. | If you meet the above requirements and are passionate about driving business growth in the IT recruitment sector, we would love to hear from you. Please submit your resume to [ | If you meet the above requirements and are passionate about driving business growth in the IT recruitment sector, we would love to hear from you. Please submit your resume to [ | hidden_email | hidden_email | ]. | ]. |  | We look forward to welcoming a talented Account Manager to our team! | We look forward to welcoming a talented Account Manager to our team!"
    },
    {
        "Job Title": "Junior It Developer",
        "Company Name": "Rubeena Shailkh",
        "Location": "Hyderabad",
        "Salary": "Not Disclosed",
        "Experience": "0 Yrs",
        "Job Description": "Qualifications:Educational Background: Any Bachelors degree. Any certification or coursework in IT, computer science, or related areas is a plus but not required.Skills: Strong analytical and problem-solving skills. Excellent communication and interpersonal skills. Eagerness to learn new technologies and adapt to a fast-paced environment.Experience: Prior experience in any industry demonstrating a strong work ethic, ability to learn quickly, and teamwork. No prior IT experience is required; however, any exposure to technical tools or platforms will be an advantage.Mindset: A proactive approach to learning and development. Willingness to take on new challenges and responsibilities."
    },
    {
        "Job Title": "Position Assistant VP (IT ARCHITECT)- MUMBAI",
        "Company Name": "T AND M SERVICES CONSULTING PVT.LTD.",
        "Location": "Mumbai City",
        "Salary": "Rs 20  - 30 Lakh/Yr",
        "Experience": "8 to 13 Yrs",
        "Job Description": "Title: Assistant Vice President - IT Architect (27 Positions) | Type: 3-Year Contract (Extendable by 2 Years) | Location: Navi Mumbai | Age Limit: Up to 42 years | Salary: Up to 35 Lakhs per annum"
    },
    {
        "Job Title": "It Trainer",
        "Company Name": "CSURE PLACEMENTS & TRAINING SERVICES PRIVATE LIMITED",
        "Location": "Kolkata",
        "Salary": "Rs 5  - 6 Lakh/Yr",
        "Experience": "3 to 5 Yrs",
        "Job Description": "Job Title: It TrainerJob Category: Software DevelopmentMain Location: Kolkata, Sector VEmployment Type: Full-TimeExperience: 3 years and aboveTechnologies: Python, Node.js, Database Management System, Fullstack web developmentRequirements:1. Bachelors or similar degree in Computer Science/Information Technology or relevant field.2. Relevant work experience as a technical faculty with expertise in Python, Dbms, Fullstack, Node.js3. Identify and analyze It skill gaps in the team, and curate training plans, course materials, resources, exercises and objectives for sessions with the respective team(s).4. Research system utilization requirements by technical teams within the organization and suggest new policies or measures for effectiveness.5. Train and equip new employees on fair usage of hardware and software, bring awareness on cyber security and office equipment usage policies.6. Evaluate technical employees through critical skill assessment tests and define the skillset needs for different roles.7. Design and develop technical training programs for employees to learn to set up It equipment for work while working from home, traveling, etc.8. Execute and conduct training sessions in-person or virtually; maintain detailed, organized reports of the training session(s) and skill development programs.9. Onboarding training of new technical talent and discerning the scope of improvement.Skills & Abilities:1. Effective communication skills in English, both written and verbal.2. Proven mentoring experience with a flair for simplifying critical, technical principles.3. Adept in web-based learning platforms, modern educational channels, and techniques.4. Additional certification in specialized training is preferred.5. Keen to keep up with new technologies, and techniques, and be able to adapt to dynamic project requirements6. A self-motivating, cooperative, and positive team player with a strong work ethic."
    },
    {
        "Job Title": "Business Development Executive ( IT , Sales  )",
        "Company Name": "Skywings Advisors Private Limited",
        "Location": "Mumbai City",
        "Salary": "Rs 4.0  - 8 Lakh/Yr",
        "Experience": "2 to 7 Yrs",
        "Job Description": "Hi ,We Are Hiring For a LeadingPrivate Limited IT Services & Consulting FarmJob Role - Business Development ExecutiveEducation - GraduationCTC -5 Lpa To 8 Lpa + IncentiveExperience Required - Min. 2 years to 6 years in software , application software product salesLocation - Mumbai!! Job Description -: !!Be primarily responsible to open new business accounts and sustain strategic customer relationships by providing a Software Application Solution & Services.Responsible for the sales of a complete portfolio of IT services in Software application, ERP & SAP, cloud technologies including professional services to Govt. Undertakings, PSUs, and all possible customers.Lead GenerationStay up to date with the tendering, process, compliances in the segment.Strategize to maximize revenue growth and communicate new product developments & services to prospective clients.Manage sales cycle from prospecting to closing & thus, maintaining sustainable revenue.Maintain and develop new strategic customer relationships within the assigned accounts.Deliver on the tactical sales plans, following up new business opportunities and setting up meetings as necessary.Be able to articulate comprehensive technological strategies to a wide range of decision-makers within an organization, including technical and business.Need to be familiar with on-premises, cloud, SAP, ERP and data centre solutions.Need to understand the competition, companies, and opportunities that exist within an assigned region or vertical market segment to make the right proposalsIf anyone interested please share. their resume / Cover letter -:hidden_mobile!! Regards !!HR Zuned ( Skywings Advisor Private Limited )"
    },
    {
        "Job Title": "It Coordinator",
        "Company Name": "KVEETECH ENTERPRISES",
        "Location": "Kalyan",
        "Salary": "Rs 1.5  - 3.0 Lakh/Yr",
        "Experience": "2 to 4 Yrs",
        "Job Description": "Installation and configuration:Install and configure software and hardware | Troubleshooting:Troubleshoot issues with computer and network systems | Training:Provide technical support and training to end users | Monitoring:Monitor system and network performance | Compliance:Ensure compliance with IT standards and functionality | Collaboration:Collaborate with other professionals | Protocol development:Develop protocols for IT use across departments and projects | Database administration:Work with database admins to ensure network security | Helpdesk:Address helpdesk tickets and assign technical staff to deal with issues"
    },
    {
        "Job Title": "Domestic IT Recruiter -1- 3 Yrs",
        "Company Name": "NexWave Talent Management Solutions Pvt. Ltd.",
        "Location": "Hyderabad",
        "Salary": "Rs 2.5  - 3.5 Lakh/Yr",
        "Experience": "1 to 4 Yrs",
        "Job Description": "Minimum 1 year of experience in IT recruitment | Must be excellent in communication skills | Candidates must be very strong in sourcing skills and have good exposure to IT skill sets | Must have a thorough understanding of the end-to-end recruitment process | Must be good at handling job boards and social media for recruiting the right candidate. | CompletelyWORK FROM OFFICE."
    },
    {
        "Job Title": "Urgent Hiring for NON IT Recruiter l Ahmedabad l RPO Model l 6 days l WFO",
        "Company Name": "Flexi Ventures Pvt. Ltd.",
        "Location": "Ahmedabad",
        "Salary": "Not Disclosed",
        "Experience": "2 to 7 Yrs",
        "Job Description": "Urgent Hiring for Non Tech Recruiter in Ahmedabad6 Days Work from officeExperience - 2+RPO HiringNotice period - Immediate to 7 DaysExperience into Bulk hiring is mustIf interested send below details or WhatsApp onhidden_mobileTotal year of experience into Non ITCurrent CTCExpected CTCNotice periodCurrent locationThanks & RegardsJyoti Jainhidden_email"
    },
    {
        "Job Title": "It Sales Manager",
        "Company Name": "HI TECH INFORMATICS PVT. LTD",
        "Location": "Bangalore",
        "Salary": "Rs 12 Lakh/Yr",
        "Experience": "10 to 17 Yrs",
        "Job Description": "IT Sales ManagerLocation: BangaloreMonthly CTC:-hidden_mobile+IncentiveWe are seeking a IT Sales Manager to join our team. The ideal candidate will have a strong track record in IT sales, proven experience in managing Profit and Loss (P&L) responsibilities, and familiarity with leading technology providers such as IBM, HP, and HCL. This role demands a strategic leader who can drive significant sales growth, manage high-value client relationships, and lead a team of sales professionals to achieve and exceed targets.Eligibility:Qualification: Bachelors degree in Business, Information Technology, Marketing, or a related field. An MBA or relevant advanced degree is highly desirable.Experience:Minimum of 10 years of experience in IT sales, with a proven track record of success in managing P&L responsibilities.Extensive experience with IT products and solutions from IBM, HP, HCL, or similar major technology providers.Demonstrated ability to lead a sales team, exceed sales targets, and build strategic client relationships.Interested candidates can send their CVs tohidden_email."
    },
    {
        "Job Title": "IT HELP Desk Bangalore 6.2lpa",
        "Company Name": "WHITE HORSE MANPOWER CONSULTANCY (P) LTD",
        "Location": "Bangalore",
        "Salary": "Rs 3.0  - 6 Lakh/Yr",
        "Experience": "1 to 5 Yrs",
        "Job Description": "Having Overall 1 years of experience in design, Implementation, Installation, and managing of LAN, and WAN Network. | Experience Creating User and Groups with Special Permissions. | Hands on Experience of Configuring Security Policies for Domain and Service Level. | Worked on installing and configuring VPN access on client machines. | Work on MBM ,Bit locker for providing the key for the user to unlock machines. | Worked on Blue screen error incidents | Worked on incidents related to MS office and office 365 installation and configuration | Experience on Network Monitoring. | Experience on Manage the Setup Configuration of System. | Day-to-day managing of Domain Controller. | Knowledge on Designing new Computer System Framework. | Experience Troubleshooting Hardware and Software Issues. | Proficiency Installing and Configuring network equipment. | Manage and support Server. Windows Server 2016."
    },
    {
        "Job Title": "US IT Recruiter",
        "Company Name": "personal requirement",
        "Location": "Hyderabad",
        "Salary": "Not Disclosed",
        "Experience": "6 to 10 Yrs",
        "Job Description": "Location: Raidurgam, Hyderabad\n\nPosition: Senior US IT Recruiter\n\nExperience Required: Minimum 6+ years\n\nAvailability: Immediate joiners only\n\nJob Summary: We are seeking a highly skilled and experienced Senior US IT Recruiter to join our team in Raidurgam, Hyderabad. The ideal candidate will have comprehensive knowledge of the end-to-end recruitment process, including expertise in various visa types, immigration rules, and policies. The candidate should be able to manage the entire hiring process independently, demonstrate exceptional communication skills, and be proficient in client and candidate coordination, negotiation, and best practices in US IT recruitment.\n\nKey Responsibilities:\n End-to-End Recruitment Process: Manage the entire recruitment lifecycle, from job posting and candidate sourcing to offer negotiation and onboarding.\n Visa and Immigration Expertise: Possess thorough knowledge of all US visa types and immigration rules and policies.\n Onboarding Formalities: Handle all aspects of the onboarding process independently, ensuring a smooth transition for new hires.\n Client and Candidate Coordination: Serve as the primary point of contact for both clients and candidates, ensuring clear and effective communication throughout the hiring process.\n Price Point Negotiation: Negotiate compensation packages effectively, balancing client budgets with candidate expectations.\n Tool Proficiency: Utilize various recruitment tools and platforms efficiently, adhering to best practices for optimal results.\n Best Practices Implementation: Bring innovative and effective recruitment strategies to achieve successful closures.\n Flexibility: Be adaptable in working hours to meet both US and domestic recruitment needs as required.\n Domestic Recruitment: Handle domestic recruitment processes as needed, demonstrating flexibility and competence in meeting diverse hiring needs.\n Commitment: Show a high level of dedication and commitment to the role, ensuring all tasks are completed with excellence.\n\nRequired Skills and Qualifications:\n Experience: Minimum of 6 years in US IT recruitment.\n Independence: Ability to work autonomously with minimal supervision.\n Communication: Excellent verbal and written communication skills.\n Coordination: Strong client and candidate coordination skills.\n Negotiation: Proven negotiation skills for salary and compensation discussions.\n Tools Proficiency: Experience with various recruitment tools and platforms.\n Flexibility: Willingness to work flexible hours and handle domestic recruitment requirements as necessary.\n Commitment: A high level of dedication to the job, with a focus on achieving recruitment goals.\n\nContacthidden_email,"
    },
    {
        "Job Title": "Livekeeping Technologies - IT Administrator",
        "Company Name": "Livekeeping Technologies Pvt Ltd.",
        "Location": "Noida",
        "Salary": "Not Disclosed",
        "Experience": "2 to 6 Yrs",
        "Job Description": "Key Responsibilities\n Set up Windows, MAC or Linux operating system on laptop/Desktop.\n Assist with the installation, configuration, and maintenance of computer systems and software applications.\n Configure operating systems, user profiles, and security settings on windows, MAC and Linux devices\n Provide first-level support for hardware, software, and network issues.\n Diagnose and resolve technical problems reported by end-users promptly.\n Troubleshoot technical issues with laptop (such as camera, mic for efficient working)\n Assist employees with MFA setup, password resets, and access permissions.\n Train and educate users on basic software and hardware usage.\n Utilizing Endpoint Manager, and Antivirus for network security\n Create and maintain policies, Deploy policies and ensure compliance is met .\n Perform routine maintenance tasks, including system updates, patches, and backups.\n Monitor network performance and security to identify and address issues proactively.\n Assist in maintaining an inventory of IT assets and equipment.\n Experience of submitting a ticket or request with Lenovo or Apple care.\n Coordinate with vendors for warranty repairs and support agreements.\n Keep track of hardware inventory and maintenance schedules\n Maintain accurate records of support requests, resolutions, and troubleshooting steps.\n Maintain accurate and up-to-date records of IT assets, repairs, and software licenses.\n Track incoming and outgoing courier shipments related to IT equipment.\n Maintain a record of courier information and update stakeholders on delivery status.\n Collaborate with IT team members to resolve complex technical issues.\n Conduct regular laptop audits to ensure security compliance, performance optimization, and risk management.\n\n(ref:hirist.tech),"
    },
    {
        "Job Title": "Lead - IT Services Sourcing",
        "Company Name": "Airtel India",
        "Location": "Other Haryana",
        "Salary": "Not Disclosed",
        "Experience": "6 to 10 Yrs",
        "Job Description": "MBA (or equivalent) in Technology or Engineering\n 6-8 years of relevant experience in sourcing/procurement of various IT services, including strategic supplier selection, contracting, renewals, software strategy life planning and costing, software licensing, software implementation cloud procurement and enterprise architecture\n Mandatory experience of driving project management, synergy initiatives, supplier selection, negotiations, purchase order management, contracts negotiation, supplier management, E-Sourcing (Oracle)\n Strong understanding of IT services procurement (across applications, infrastructure and cloud), including planning, negotiations and contracting models.\n Experience in analyzing in T&M, Managed Services & COE contracts to identify opportunities for savings, revenue assurance.\n General understanding of broad IT strategy and sourcing space and working market knowledge (e.g., key vendors, services and technology trends)\n Ability to engage and interact independently with client personnel incl. procurement specialists\n Willingness to work in a highly demanding and result-oriented team environment and to travel to other offices/client locations for short/long term assignments\n Solid problem-solving capabilities with excellent analytical and quantitative skills\n Superior written/verbal communications skills\n Demonstrated business acumen, ability to grasp technical requirements and communicate effectively with business unit and corporate personnel in order to meet customer expectations.\n MNC Large Corporate in IT ITES Telecom industry preferred.,"
    },
    {
        "Job Title": "IT Project Manager",
        "Company Name": "Vaamoz Online Private Limited",
        "Location": "All India",
        "Salary": "Not Disclosed",
        "Experience": "5 to 9 Yrs",
        "Job Description": "IT Project Manager - Fintech (Technical Expertise)\n\nDo you thrive in the fast-paced world of FinTech and have a passion for delivering\n\ninnovative technology solutions  Are you an IT Project Manager with a strong technical\n\nbackground and a proven track record of success  If so, we want to hear from you!\n\nAbout the Role:\n\nWe are seeking a highly motivated and experienced IT Project Manager to join our growing FinTech team. You will be responsible for leading and managing the entire project lifecycle, from initiation and planning to execution, monitoring, and closure. You will work closely with\n\ncross-functional teams, including developers, designers, and business stakeholders, to ensure projects are delivered on time, within budget, and meet all technical requirements.\n\nResponsibilities:\n\n Develop and maintain detailed project plans, including timelines, budgets, and resource\n\nallocation.\n\n Manage project scope, ensuring alignment with business objectives and mitigating risks.\n\n Lead and motivate project teams, fostering collaboration and clear communication.\n\n Track project progress and identify and address any potential issues proactively.\n\n Manage project risks and dependencies, implementing mitigation strategies as needed.\n\n Ensure adherence to all technical standards and best practices.\n\n Work with developers to understand technical feasibility and translate business requirements into actionable solutions.\n\n Conduct project reviews and report on progress to stakeholders.\n\n Oversee project documentation and ensure clear and concise communication throughout the project lifecycle.\n\nQualifications:\n\n Bachelor's degree in Computer Science, Information Technology, or a related field (MBA\n\npreferred).\n\n PMP (Project Management Professional) certification or equivalent experience strongly\n\npreferred.\n\n Minimum 5+ years of experience as an IT Project Manager.\n\n Proven experience managing complex IT projects in the FinTech industry (a plus).\n\n Strong understanding of Agile methodologies (Scrum, Kanban) and Waterfall\n\nmethodologies.\n\n Excellent analytical and problem-solving skills.\n\n Experience in project budgeting, cost estimation, and resource management.\n\n Strong communication, interpersonal, and negotiation skills.\n\n Ability to work independently and as part of a team.\n\n Proficient in project management software (e.g., Jira, Asana, Trello).\n\n In-depth knowledge of IT infrastructure, software development lifecycle (SDLC), and security best practices.\n\nBenefits:\n\nWe offer a competitive salary and benefits package, including paid time off, and a chance to\n\nwork on cutting-edge technology in a dynamic and innovative environment.\n\nJob Type: Full-time\n\n\nJadwal:\n Day shift\n Fixed shift\n Monday to Friday\n\nTunjangan:\n Flexible schedule\n Paid sick time\n Paid time off\n Work from home\n\nUpah Tambahan:\n Performance bonus\n Shift allowance\n Yearly bonus\n\nApplication Question(s):\n what is your current location \n\nExperience:\n total work: 3 years (Preferred)\n\nWork Location: In person\n\nSpeak with the employer\n+91hidden_mobileApplication Deadline: 12/08/2024,"
    },
    {
        "Job Title": "Bajaj Allianz - Vice President/Head - IT Infrastructure",
        "Company Name": "Bajaj Allianz Life Insurance Company Ltd",
        "Location": "Other Maharashtra",
        "Salary": "Not Disclosed",
        "Experience": "10 to 14 Yrs",
        "Job Description": "Vice President - Head of IT Infrastructure\n Partners with SVP & CIO to lead the technology infrastructure strategy and execution for the enterprise\n Planning, project management and implementation leadership, identifying opportunities for automation, cost savings, and service quality improvement.\n Provides infrastructure services vision, enables innovation and seeks to leverage IT trends that can create business value consistent with the company's requirements and expectations\n Development of enterprise standards and technology architecture and the IT operations governance process.\n Conduct product and vendor evaluations ensuring best in class technologies and partners\n Works closely with and manage strategic vendor partner relationships. Setup and run the Governance with the partners. Build strategic relationships for creating value for the organization.\n Ensure the defined end user service SLAs are over achieved & voice of internal & external customers is improved.\n Ensure software license & security compliance.\n Actively review asset management and compliance & ensure there are no gaps.\n Participate in the formulation of the company's enterprise architecture and business system plans; assessing cost and feasibility, and ensuring the plan is aligned with and supports the strategic goals of the business.\n Hands-on technical depth enables direct oversight, problem-solving leadership and participation for complex infrastructure implementation, system upgrades and operational troubleshooting.\n Experience with comprehensive disaster recovery architecture and operations, including storage area network and redundant, highly available server and network architectures.\n Leadership for delivery of 24/7 service operations and KPI compliance.\n\n(ref:iimjobs.com),"
    },
    {
        "Job Title": "IT Support Analyst",
        "Company Name": "athenahealth",
        "Location": "Chennai",
        "Salary": "Not Disclosed",
        "Experience": "1 to 5 Yrs",
        "Job Description": "Join us as we work to create a thriving ecosystem that delivers accessible, high-quality, and sustainable healthcare for all.\n\nWe are looking for a highly motivated and customer-oriented IT Support Analyst to join our dynamic IT support team. As an IT Support Analyst, you will be responsible for providing technical assistance and support to end-users, troubleshooting hardware and software issues, and ensuring the smooth operation of our IT systems and infrastructure.\n\nPosition Overview\n\nThis role involves providing technical assistance and support to end-users, troubleshooting hardware and software issues, and ensuring the smooth operation of IT systems and infrastructure. You will be responsible for diagnosing and resolving technical problems, assisting with user account management, and maintaining computer systems and peripherals.\n\nJob Responsibilities\n Provide technical support to end-users via phone, email, or in-person, addressing hardware, software, and network-related issues.\n Diagnose and resolve technical problems, escalating complex issues to appropriate teams when necessary.\n Install, configure, and maintain computer systems, software, and peripherals.\n Assist with user account management, including creating, modifying, and disabling user accounts as per company policies.\n Collaborate with other IT teams to ensure timely resolution of incidents and requests.\n Document all support activities, including ticket creation, troubleshooting steps, and resolutions, in the ticketing system.\n Maintain an up-to-date knowledge base by documenting known issues, workarounds, and solutions.\n Document support activities, contribute to knowledge management, and collaborate with other IT teams to ensure timely incident resolution.\n Conduct user training sessions to enhance their understanding of technology and promote self-service options.\n Participate in IT projects and initiatives, providing technical expertise and support as required.\n Stay updated with the latest technologies, industry trends, and best practices in IT support.\n\nDesired Skills, Experience & Qualifications:.\n Prior experience of 1 year in providing technical support in a professional environment.\n Strong knowledge of Windows and Mac operating systems, Microsoft Office Suite, and common business applications.\n Familiarity with network protocols, hardware, and troubleshooting techniques.\n Excellent problem-solving and analytical skills, with the ability to diagnose and resolve technical issues efficiently.\n Excellent communication skills, both verbal and written, with the ability to explain technical concepts to non-technical users.\n Customer-focused mindset with a passion for delivering exceptional customer service.\n Ability to work independently and collaboratively in a fast-paced environment.\n Strong problem-solving skills and a customer-centric mindset are essential for success in this role.\n\nAbout Athenahealth\n\nHeres our vision:To create a thriving ecosystem that delivers accessible, high-quality, and sustainable healthcare for all.\n\nWhats unique about our locations \n\nFrom an historic, 19th century arsenal to a converted, landmark power plant, all of athenahealths offices were carefully chosen to represent our innovative spirit and promote the most positive and productive work environment for our teams. Our 10 offices across the United States and India  plus numerous remote employees  all work to modernize the healthcare experience, together.\n\nOur Company Culture Might Be Our Best Feature.\n\nWe don't take ourselves too seriously. But our work  Thats another story. athenahealth develops and implements products and services that support US healthcare: Its our chance to create healthier futures for ourselves, for our family and friends, for everyone.\n\nOur vibrant and talentedemployees  or athenistas, as we call ourselves  spark the innovation and passion needed to accomplish our goal. We continue to expand our workforce with amazing people who bring diverse backgrounds, experiences, and perspectives at every level, and foster an environment where everyathenistafeels comfortable bringing their best selves to work.\n\nOur size makes a difference, too: We are small enough that your individual contributions will stand out  but large enough to grow your career with our resources and established business stability.\n\nGiving back is integral to our culture. Our athenaGives platform strives to support food security, expand access to high-quality healthcare for all, and support STEM education to develop providers and technologists who will provide access to high-quality healthcare for all in the future. As part of the evolution of athenahealths Corporate Social Responsibility (CSR) program, weve selected nonprofit partners that align with our purpose and let us foster long-term partnerships for charitable giving, employee volunteerism, insight sharing, collaboration, and cross-team engagement.\n\nWhat can we do for you \n\nAlong with health and financial benefits, athenistas enjoy perks specific to each location, including commuter support, employee assistance programs, tuition assistance, employee resource groups, and collaborativeworkspaces some offices even welcome dogs.\n\nIn addition to our traditional benefits and perks, we sponsor events throughout the year, including book clubs, external speakers, and hackathons. And we provide athenistas with a company culture based on learning, the support of an engaged team, and an inclusive environment where all employees are valued.\n\nWe also encourage a better work-life balance for athenistas with our flexibility. While we know in-office collaboration is critical to our vision, we recognize that not all work needs to be done within an office environment,full-time. With consistent communication and digital collaboration tools, athenahealthenablesemployees to find a balance that feels fulfilling and productive for each individual situation.,"
    },
    {
        "Job Title": "Senior Software Engineer - IT Compliance T500-10066",
        "Company Name": "Bristol Myers Squibb",
        "Location": "Hyderabad",
        "Salary": "Not Disclosed",
        "Experience": "6 to 10 Yrs",
        "Job Description": "BMS Hyderabad is an integrated global hub where our work is focused on helping patients prevail over serious diseases by building sustainable and innovative solutions. This important science, technology, and innovation center will support a range of technology and drug development activities that will help us usher in the next wave of innovation.\n\nPosition Summary\n\nAt BMS, digital innovation and Information Technology are central to our vision of transforming patients lives through science. To accelerate our ability to serve patients worldwide, we must unleash the power of technology. We are committed to transforming the way medicine is made and delivered by harnessing the power of computer and data science, artificial intelligence, and other technologies to promote scientific discovery, faster decision-making, and enhanced patient care.\n\nThe Data Integrity and Computer System Validation (CSV) team, part of BMS Global Manufacturing IT organization, is seeking an IT Compliance. Engineering to meet evolving and growing needs for IT/Compliance across the companys manufacturing operations. The successful candidate will apply their compliance/validation skills to validate manufacturing and laboratory systems to support BMS worldwide manufacturing operations directly.\n\nIf you want a meaningful, exciting, rewarding career, consider joining our diverse team!\n\nKey Responsibilities\n Develop and maintain a complete understanding of BMS IT compliance policies and procedures related to all aspects of computer system validation.\n Identify and assess potential risks and vulnerabilities in IT systems and processes and develop and implement risk mitigation strategies.\n Conduct regular audits and assessments of IT systems, processes, and controls to ensure compliance with applicable regulations and standards.\n Participate in regulatory inspections and audits, and support compliance-related activities as needed.\n Provide guidance and training to IT staff and other stakeholders on compliance requirements and best practices.\n Maintain accurate and up-to-date records and documentation related to IT compliance activities.\n Continuously evaluate and improve IT compliance processes and procedures to ensure effectiveness and efficiency by staying current with emerging trends and technologies in IT compliance and providing recommendations for improvement.\n Development of Validation strategy, Validation Master Plans related to computer systems validation.\n Develop and review Computer System Validation Artifacts, including Validation Master plans, Requirements Specification, Design Specifications, Test Plans (System Test, User Acceptance Test, Installation Qualification), Test Summary Reports (System Test, User Acceptance Test, Installation Qualification), Traceability Matrix, Validation Summary Report, Release for Use Memo, SOP's, Work Instructions.\n Ensure that the validation artifacts meet the quality requirements and applicable regulations of FDA, EU, Corporate & International Standards.\n Pre-approve and post-approve validation documentation and assessments from a quality perspective.\n Provides CSV expertise and guidance related to management, peers, and lower-level professionals.\n Participate in the Change Management process, ensuring that all changes to validated computer systems are effectively assessed and that regulatory compliance is always maintained.\n Lead the Validation team to ensure all aspects of activity within the group adhere to required policies and procedures, including safety and training.\n Lead the Validation team in preparation for regulatory, internal, and corporate audits and inspections.\n Represent Validation and BMS for audits and any corporate events (as required).\n Report out to senior management on Validation status and metrics. Keep abreast of changing regulatory requirements, standards, and guidelines.\n\nQualifications & Experience\n The IT Compliance Engineer should hold a minimum of a BS qualification (Degree) in a scientific, technical or engineering discipline along with 6+ years experience in pharmaceutical/ biopharmaceutical manufacturing facilities.\n Knowledge of capabilities such as ServiceNow, JIRA, Python, and SQL are beneficial, such as experience configuring JIRA workflows, dashboard, and reports to support visibility and evaluation of process opportunities.\n A strong background in focusing on technical solutions.\n Growth mindset, enthusiastic about pioneering technology in a regulated industry.\n Critical thinking and problem-solving skills, with the ability to troubleshoot and resolve complex challenges, using technology to drive productive change.\n Experience with adhering to internal and external requirements, which may include FDA (21CFR, part 11), EMA (Annex 11), GAMP and all other Worldwide Regulatory requirements (ICH Q7, Q8, Q9).\n Knowledge of Quality principles, computer system development lifecycles, QA methodologies, S88 batch control standards and the and ISA-95 manufacturing plant levels.\n Knowledge of Quality principles, computer system development lifecycles, QA methodologies, S88 batch control standards and the and ISA-95 manufacturing plant levels.\n Knowledge of SOPs, cGMPs and compliance requirements and regulatory guidelines and the technical acumen to work and manage within a regulatory environment.\n Relevant experience with data integrity requirements and implementation in a GMP environment.\n Knowledge of leading a successful team to project completion.\n Problem solving ability and excellent oral and written communications skills.\n Experience dealing with regulatory agencies and global audit teams.\n Excellent communication skills and ability to influence others.\n\nWhy You Should Apply\n\nAround the world, we are passionate about making an impact on the lives of patients with serious diseases. Empowered to apply our individual talents and diverse perspectives in an inclusive culture, our shared values of passion, innovation, urgency, accountability, inclusion, and integrity bring out the highest potential of each of our colleagues.\n\nBristol Myers Squibb recognizes the importance of balance and flexibility in our work environment. We offer a wide variety of competitive benefits, services and programs that provide our employees with the resources to pursue their goals, both at work and in their personal lives.\n\nOur company is committed to ensuring that people with disabilities can excel through a transparent recruitment process, reasonable workplace adjustments and ongoing support in their roles. Applicants can request an accommodation prior to accepting a job offer. If you require reasonable accommodation in completing this application, or any part of the recruitment process direct your inquiries tohidden_email/eeo-accessibility to access our complete Equal Employment Opportunity statement.\n\n#HYDIT #LI-Hybrid,"
    },
    {
        "Job Title": "US IT SALES",
        "Company Name": "Plaxonic",
        "Location": "Noida",
        "Salary": "Not Disclosed",
        "Experience": "3 to 7 Yrs",
        "Job Description": "Location: Noida, Sector 59\n\nJob Type: Full-time*\n\nShift: Night Shift (7:00 PM - 4:00 AM, 5 Days Working)\n Job Description:*\n\nWe are seeking a dynamic and experienced US IT Sales Executive to join our team in Noida, Sector 59. The ideal candidate should have a Bachelor's degree in Business, Marketing, or a related field, along with a proven track record in IT sales, demonstrating the ability to consistently meet or exceed sales targets. The role requires a deep understanding of the US IT market and industry trends. The candidate should possess excellent communication and presentation skills, as well as the ability to establish and nurture relationships with key stakeholders. We are looking for a results-oriented and self-motivated professional who thrives in a challenging sales environment.\n\nKey Responsibilities:\n\n1.Identify and pursue new business opportunities in the US IT market.\n\n2.Develop and maintain strong relationships with clients and key stakeholders.\n\n3.Meet or exceed sales. targets through effective sales strategies and client engagement.\n\n4.Stay updated on industry trends and market dynamics to provide valuable insights.\n\n5.Collaborate with the internal team to ensure seamless delivery and client satisfaction.\n\nCandidate Profile:\n\n1.Bachelor's degree in Business, Marketing, or a related field.\n\n2.Proven experience in IT sales with a successful sales track record.\n\n3.Strong understanding of the US IT market and industry trends.\n\n4.Excellent communication and presentation skills.\n\n5.Ability to build and maintain relationships with key stakeholders.\n\n6.Results-oriented and self-motivated.\n Interested candidates can share their cv-hidden_email,"
    },
    {
        "Job Title": "IT project Manager",
        "Company Name": "Burns & McDonnell India",
        "Location": "Other Maharashtra",
        "Salary": "Not Disclosed",
        "Experience": "4 to 8 Yrs",
        "Job Description": "Description\n\nRole Purpose : This role involves working as part of a Project Management Team to administer and monitor project and (its sub projects) according to quality, plan, time, and benefits realization are controlled and achieved, through ensuring that all projects adhere to the timelines and the team is connected to meet the ultimate goal.\n\nKey Responsibilities\n Ensure the successful implementation of the IT Projects, responsibilities, services and deliverables.\n Provide and maintain a capacity planning and resource tracking service across the Projects\n Update and maintain the various project documents (Project Log, Action Log, Decisions Logs)\n Ensure cross-projects dependencies are managed and the dependency log is accurately maintained.\n Coordinate project closure to distil good practice and ensure lessons learned are logged.\n Build cohesion within the team and motivate team to produce quality work.\n Define and embed project control and governance\n Provide Project. planning, Milestone management, Scope management, Resource forecasting; & Change Management across the project portfolio\n Prepare regular status reporting for the engagement leadership\n\nRole Competency ;\n PMP certification is a must\n Identify project needs and develop a detailed timeline for completion\n Coordinate a Software development / Application Management Teams\n Collaborate with multilocation/multi discipline teams\n Monitor scope, time, costs compliance and create detailed reports for management\n Keep track of a projects progress and ensure its completion before the deadline\n Work within Project constraints (scope, time, cost and resource allocation)\n\nSpecific Role Requirements\n Team leadership experience\n Project Coordination and Project Engineering experience\n Project methodologies (PMP, Agile, Scrum, Critical Chain Project Management, etc.)\n Project management tools (MS Planner JIRA etc.)\n\nNice To Have\n Experience of reputed global EPC/EPCm and or Engineering consultants\n Knowledge of Engineering Procurement & Construction execution process\n Awareness to Latest Programming languages and IT Technologies\n Certifications in Project Management and Execution Methodologies (Scrum, Agile)\n\nQualifications\n\nThe candidate should have a Bachelors degree in relevant field.The candidate should have a work experience of 4-6 years\n\nJob Project Management\n\nPrimary Location India-Maharashtra-Mumbai\n\nSchedule: Full-time\n\nTravel: No\n\nReq ID: 222453 Job Hire Type Experienced\n\nNot Applicable #BMI N/A,"
    },
    {
        "Job Title": "IT Support Engineer - Ticketing System",
        "Company Name": "MNR Solutions Pvt. Ltd.",
        "Location": "Chennai",
        "Salary": "Not Disclosed",
        "Experience": "3 to 7 Yrs",
        "Job Description": "Job Description\n\nWe are seeking a skilled IT Support Engineer to join our team in Chennai. The ideal candidate will have over 3 years of experience in IT support, with expertise in ticketing, monitoring, and AWS services including EC2 and CloudWatch. You will be responsible for maintaining the IT infrastructure, resolving technical issues, and ensuring system performance and reliability.\n\nResponsibilities\n Provide technical support and resolve issues related to IT infrastructure.\n Monitor system performance using tools like AWS CloudWatch and ensure optimal functionality.\n Manage and resolve tickets through the ticketing system promptly.\n Maintain and troubleshoot AWS environments, including EC2 instances.\n Collaborate with other IT teams to ensure seamless operations.\n Perform regular system updates and maintenance to ensure stability and security.\n Document processes and provide training to end-users as needed.\n\nQualifications\n\n- Bachelor's degree in Information Technology, Computer Science, or a related field.-\n Minimum of 3 years of experience in IT support.\n Proficiency in monitoring tools and ticketing systems.\n Hands-on experience with AWS services, particularly EC2 and CloudWatch.\n Strong problem-solving skills and attention to detail.\n Excellent communication and interpersonal skills.\n Ability to work in a fast-paced environment and manage multiple tasks.\n\n(ref:hirist.tech),"
    },
    {
        "Job Title": "IT Recruiter (Enterprise saas)",
        "Company Name": "Nimesa",
        "Location": "Other Karnataka",
        "Salary": "Not Disclosed",
        "Experience": "0 to 3 Yrs",
        "Job Description": "About Nimesa\n\nNimesa is a venture-funded product based startup, founded by Ex Netapp, and Oracle executives. We are building award-winning product to help businesses recover from cyberattacks instantly. Nimesa is protecting many marquee brands in India and the US in BFSI, healthcare, Govt, fintech, and other industries.\n\nJob Description\n\nOur data protection company is seeking a IT Recruiter to acquire new talent for our rapidly growing departments. We are looking for someone who can keep pace with current growth and recruit talents according to our organization's needs. The successful candidate will have a keen eye when reviewing resumes and conducting pre-screening interviews. If you re sharp, professional, and have good communication skills, we would like to speak with you about this opportunity.\n\nWe would like to hear from you if:\n You have strong attention to detail and strive to optimize processes to create efficiencies\n You are energized by asking questions and thinking. creatively to develop innovative talent solutions.\n Your influencing and flexible engagement style make you a vital part of the growth and success of the company.\n\nResponsibilities\n Develop and execute effective talent acquisition strategies for Technical Hiring\n Utilize advanced sourcing techniques to identify and attract top-tier talent.\n Collaborate with hiring managers to understand specific role requirements and create targeted recruitment plans.\n Conduct thorough screening and assessment processes to ensure the selection of high-performing candidates.\n Manage end-to-end recruitment processes, including job postings, interview coordination, and offer negotiation.\n Build and maintain a robust pipeline of potential candidates through networking, industry events, and other channels.\n Stay updated on industry trends and competitor practices to enhance recruitment strategies.\n\nRequirements\n Bachelor's/Masters degree in Human Resources, or a related field is must.\n In-depth knowledge of advanced sourcing techniques and tools for Technical talent acquisition.\n Familiarity with the Technical roles, including understanding key skills and attributes for success.\n Excellent communication and interpersonal skills to effectively collaborate with hiring managers and candidates.\n Ability to work in a fast-paced environment and manage multiple priorities simultaneously.\n Data-driven approach to recruitment, with a focus on measurable outcomes and continuous improvement.\n Knowledge of trends in IT Market.\n\nPreferred\n Relevant certifications in talent acquisition or recruitment.\n Proven experience for a minimum of 0 to 1 year as a Talent Acquisition Specialist in a high-growth Enterprise SaaS environment.\n Strong understanding of the Enterprise SaaS landscape and its specific hiring challenges.\n Experience with Applicant Tracking Systems (ATS) and other recruitment technologies.\n Demonstrated success in building diverse and inclusive IT teams.\n\nJoin us in revolutionizing the future of Enterprise SaaS! If you're passionate about finding the best talent and thrive in a dynamic environment, we want to hear from you.\n\nIf you are looking for a role where you can truly make a positive impact, take ownership, build a career and makechange - apply now.\n\nCompensation: 3 to 3.6 LPA\n\nLocation: HSR Layout, Bengaluru (In-Office)\n\nExperience: 0 to 1 year\n\nWorking days: 6 days (Monday to Saturday,"
    },
    {
        "Job Title": "IT Administrators JAIPUR  FULL-TIME",
        "Company Name": "Webcontxt",
        "Location": "Jaipur",
        "Salary": "Not Disclosed",
        "Experience": "2 to 6 Yrs",
        "Job Description": "Responsibilities\n Manage electronic equipment\n Install network and computer system\n Maintain, repair and upgrade the operating system including hardware and software\n Monitor the performance of existing computer systems and IT infrastructures\n Assess present network serves, operating systems and security layer\n Upgrade hardware and software programs\n Install and implement effective security systems\n Perform data backup and recovery processes\n Resolve issues with systems and programs\n\nQualifications:\n Bachelor's degree in computer science, information technology, information systems, or similar.\n Applicable professional qualification, such as Microsoft, Oracle, or Cisco certification.\n At least two years\" experience in a similar role.\n Extensive experience with IT systems, networks, and related technologies.\n Solid knowledge of best practices in IT administration and system security.,"
    },
    {
        "Job Title": "Senior IT Auditor- Curaao",
        "Company Name": "EY",
        "Location": "Other Haryana",
        "Salary": "Not Disclosed",
        "Experience": "2 to 6 Yrs",
        "Job Description": "EY Dutch Caribbean is currently seeking a qualified candidate to fill the position of Senior IT Auditor in our Curaao office. This is an excellent opportunity for an experienced professional to join a leading global organization and contribute to our account-centric growth strategy.\n\nLocation: Curaao, Dutch Caribbean\n\nThe Opportunity:\n\nAs a Senior IT Auditor, you will help our clients evaluate and enhance their business. You will be part of our account centric growth strategy focusing on issue-based and competency-driven client needs. That's what differentiates EY in the consulting marketplace.\n\nYour Key Responsibilities:\n\nEverything you will be involved in comes down to providing excellent customer service and helping ensure your teams do the same. Whether it is managing multiple client teams, leading IT internal audit engagements, external audit integration, or service organization control (SOC) reporting as well as assisting with business development activities across financial services sectors, you will build strong relations ships and become a trusted advisor to your clients.\n\nSkills and attributes for success\n Working with client personnel to analyze, evaluate and enhance information systems facilitating the business internal control process, and assisting clients and other technology professionals in performing information technology control audits, information technology control engagements, security audits and security engagements.\n Collaborating with other members of the engagement team to plan the engagement and develop work program timelines, risk assessments, budgets and other planning documents.\n Working with the engagement team to document the flow of business processes and relevant controls dependent on information technology.\n Serving as a fieldwork leader by directing the daily progress of fieldwork, informing supervisors of engagement status and managing staff performance.\n Demonstrating and applying a thorough understanding of complex information systems.\n Using knowledge of the current IT environment and financial services industry IT trends to identify the engagement and client service issues, and communicating this information to the engagement team and client management through written correspondence and verbal presentations.\n Demonstrating and applying strong project management skills, inspiring teamwork and responsibility with engagement team members, and using current technology and tools to enhance the effectiveness of deliverables and services.\n\nTo qualify for the role you must have:\n A bachelors degree with a minimum of 3 years of related work experience, or a masters degree with approximately 2 years of related work experience.\n A degree in business, accounting, finance, computer science, information systems, or a related discipline.\n At least 2 years of experience as an IT auditor or IT risk advisor for a public accounting firm, professional services firm, or financial services company.\n Experience in one or more of the following: internal audit risk assessment, financial statement audits/SOX/internal controls, Service Organization Control (SOC) reporting, ERP security, and control reviews (e.g., Oracle, SAP, Workday).\n Strong project management, communication (English, Dutch & Papiamentu), leadership, and client service skills.\n Demonstrated integrity within a professional environment.\n Willingness to travel to meet client obligations.\n\nIdeally, Youll Also Have:\n\nCertifications such as CA, CGEIT, CIA, CISA, CISM, CISSP, CMA, CPA, or CRISC. Non-certified hires are required to become certified for promotion to Manager.\n\nWhat we look for:\n\nWe are looking for leaders with a genuine creative vision and the confidence to make it happen. You should have the ability to take initiative, seek out opportunities to improve our current relationships and processes, and be ready to tackle some of our clients\" most complex issues.\n\nWhat we offer\n\nAs a member of the EY family, you will have access to:\n Continuous learning: You'll develop the mindset and skills to navigate whatever comes next.\n Success as defined by you: We'll provide the tools and flexibility, so you can make a meaningful impact, your way.\n Transformative leadership: We'll give you the insights, coaching and confidence to be the leader the world needs.\n Diverse and inclusive culture: You'll be embraced for who you are and empowered to use your voice to help others find theirs.\n\nHow to Apply:\n\nInterested candidates are invited to submit their application, including a resume and cover letter, just click on apply. Please ensure that your application clearly demonstrates how your skills and experiences align with the responsibilities and qualifications outlined above.\n\nEY Dutch Caribbean is an equal opportunity employer committed to diversity and inclusion. We encourage all qualified candidates to apply and look forward to welcoming you to our team.\n\nJoin us and contribute to building a better working world.,"
    },
    {
        "Job Title": "IT Network & Security Manager",
        "Company Name": "Onx Homes",
        "Location": "Other Karnataka",
        "Salary": "Not Disclosed",
        "Experience": "8 to 12 Yrs",
        "Job Description": "About ONX HOMES:\n\nONX Homes is an integrated Design Tech company on a mission to reshape the home building industry. Founded by construction experts, design thinkers, and technology leaders, we utilize human-centric design, environmentally conscious materials, and offsite manufacturing technology to create beautiful homes and sustainable communities. We partner with landowners and leverage our unique vertically integrated capabilities and advanced offsite construction facilities to build and deliver sustainable, high-quality homes in half the time of onsite construction.\n\nRecruitment Policy:\n\nONX Homes will recruit based on merit and in compliance with all relevant legislation and is committed to recruitment and selection processes that are open, competitive, and based on merit. We are committed to valuing diversity and promoting equality.\n\nONX Homes is looking for an IT Network & Security Manager to join our team.\n\nThe N&SM is responsible for establishing and maintaining a corporate wide information security management program to ensure that information assets are adequately protected. This position is responsible for identifying, evaluating, and reporting on information security risks in a manner that meets compliance and regulatory requirements, and aligns with and supports the risk posture of ONX Group of Companies.\n\nResponsibilities:\n Manage IT Security Operations budget and resources and participate in IT planning and project management.\n Strengthen and formalize security processes both within the security team and with other supporting resources.\n Oversee and manage security projects including design, implementation, and integration of new or upgraded technologies.\n Manage industry best practice guidance and security hardening guidelines for all technologies.\n Manage the Identity and Access Management (IAM) Program.\n Working closely with cross-functional teams to communicate and integrate control requirements (IT, General Counsel, HR, Finance, others, etc.);\n Managing all internal and external security compliance engagement activities.\n Managing, documenting, and communicating compliance requirements, timelines, and road map to supporting teams and leadership.\n Leads the effort to develop, enhance and implement security training program based on policies.\n Communicating the compliance posture and effectiveness to management on a scheduled basis.\n Developing and working with supporting teams to design and implement an automated control strategy and exception reporting process.\n\nRequired Qualifications:\n Professional Security Certification (e.g., CCNA, CCNP, MCITP/MCSE, CCSP, CompTIA Security+, CISSP, GIAC, CISM) required.\n Fundamental knowledge of web applications protocols (and web services frameworks (JAVA, APACHE, .NET);\n Bachelor s or Master s degree in Information Technology and or commensurate experience in delivering security solutions.\n Overall Enterprise IT Security experience of 8+ years preferred.\n Absolutely trustworthy with high standards of personal integrity (demonstrated by an unblemished career history, lack of criminal convictions etc.), willing to undergo vetting and/or personality assessments to verify this if necessary\n Typically, a background in technical security roles or operations, with a clear and abiding interest in security\n Excellent experience with Enterprise firewalls (PaloAlto- Must)\n Experience with Splunk, CrowdStrike, Proofpoint is a plus.\n Experience with multi-factor authentication, intrusion detection, and managing threat intelligence.\n Strong decision-making skills and excellent analytical ability.\n Ability to make a business case and hire, train, and build a strong IT Security Team; lead and manage technical personnel.\n Strong self-directed work habits, exhibiting initiative, drive, creativity, maturity, self-assurance, and professionalism.\n Must be willing to work in a start-up environment and extend support / responsibilities to other IT functions.\n Industry knowledge of border testing, security policies, DR procedures & policies, remediation strategies and risk assessment are required.\n Ability to complete work to given quality standards by agreed-upon deadlines.\n Knowledge of JIRA is a plus.\n Ability & desire to learn new product lines and technologies quickly & efficiently.\n Strong knowledge of IT controls, including security concepts and terminology related to applications, databases, operating systems, and IT operations.\n Experience with data protection & archiving, disaster recovery, business continuity and implementation.\n Strong written communication skills, demonstrating the ability to write with purpose, clarity, and accuracy.\n Must be able and willing to write and deploy security policies and procedures.\n\nPhysical Requirements\n\nThe physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this job. While performing the duties of this job, the employee is regularly required to stand; walk; sit; use hands to finger, handle, or feel objects, or controls; reach with hands and arms; climb stairs; balance; stoop, kneel, or crouch; and talk or hear. The employee must occasionally lift or move up to 15 pounds. Specific vision abilities required by the job include close vision, distance vision, color vision, peripheral vision, depth perception and the ability to adjust focus.\n\nIf this sounds like you, you should apply right away so we can discuss how you can be a part of this exciting, fast-paced organization!\n\n\nIf this sounds like you, you should apply right away so we can discuss how you can be a part of this exciting, fast-paced organization!\n,"
    },
    {
        "Job Title": "IT System Administrator",
        "Company Name": "Saleshandy",
        "Location": "Other Gujarat",
        "Salary": "Not Disclosed",
        "Experience": "2 to 6 Yrs",
        "Job Description": "We are looking for a IT System Administrator to maintain, upgrade and manage our software, hardware and networks.\n\nResourcefulness is a necessary skill in this role. You should be able to diagnose and resolve problems quickly. You should also have the patience to communicate with a variety of interdisciplinary teams and users.\n\nYour goal will be to ensure that our technology infrastructure runs smoothly and efficiently.\n\nResponsibilities\n Install and configure software and hardware\n Manage network servers and technology tools\n Set up accounts and workstations\n Monitor performance and maintain systems according to requirements\n Troubleshoot issues and outages\n Ensure security through access controls, backups and firewalls\n Upgrade systems with new releases and models\n Develop expertise to train staff on new technologies\n Build an internal wiki with technical documentation, manuals and IT policies\n\nRequirements\n Proven experience as a System Administrator or similar role\n. Working Experience with databases, networks (LAN, WAN) and patch management\n Knowledge of system security (e.g. intrusion detection systems) and data backup/recovery\n Familiarity with various operating systems and platforms\n Resourcefulness and problem-solving aptitude\n Excellent communication skills\n BSc/Ba in Information Technology, Computer Science or a related discipline; professional certification (e.g. Microsoft Certified Systems Administrator (MCSA)) is a plus\n\nOther Perks:\n Personal Development  an annual budget for books, courses, and conferences\n Medical Insurance  we offer health insurance allowance to all the teammates\n Annual team retreats  to amp up the entire team's energy every year, we take a retreat. you will decide the place. Check out our recent trip to Udaipur,"
    },
    {
        "Job Title": "Business Development Manager - Enterprise IT Sales",
        "Company Name": "My Placement Management Consultants",
        "Location": "Other Maharashtra",
        "Salary": "Not Disclosed",
        "Experience": "5 to 9 Yrs",
        "Job Description": "Job Title Business Development Manager\n\nLocation Mumbai\n\nJob Background\n\nThe business Development Manager will be responsible for the Business Development of the Enterprise market by identifying opportunities, validating and winning them. He/ She will be responsible for building and maintaining the Customer relationships. He/ She will be responsible for identifying the market needs and introduction of new products in the marketplace and supporting project deliveries\n\nJob Purpose\n\nBusiness Development Manager - Enterprise, will be overall responsible for building business as per the business plan. He/ She will be required to plan, monitor Topline and Bottom-line for the Carriers and Enterprise Business opportunities\n\nA) Strategic Role:\n Business Plans year on year\n New Product & Business Development\n Brand Building Strategies\n Identification and segregation of potential Market Segment\n Revenue generation through new account development and key account management\n\nB) Operational Role:\n Responsible for achieving sales target\n Defining the exact marketing processes and being responsible for executing the same.\n Developing relevant business proposals\n Monitor market Intelligence within the industry in terms of market development, new projects, competitive activity, new customers etc.\n Handling meetings with key clients\n Managing Technical Aspects\n Provide necessary training to Sales/BSG/ Project team as and when needed\n Support and guide in Project Delivery and Implementation\n\nPrincipal Responsibilities\n\nThe responsibilities of the Manager\n will be responsible for generating new business relationships and negotiating new revenue for agreed targets\n will be responsible for keeping our sales contracts up to date and for checking all sales contracts prior to signature to ensure company policies are upheld\n will be expected to lead enterprise-level sales opportunities and coordinate\n will be expected to lead by example and maintain the highest standards of administration in accordance with the agreed sales process, ensuring that the CRM systems are accurately updated and that the required documentation is completed by you and your team for all new business opportunities\n will develop and maintain effective prospective client and existing agency relationships\n will contribute to the personal development of all Business Development Managers and Executives through excellent leadership and performance management,\n Will support in the product and Technical Aspects of the Solution\n will represent company at national and international industry events\n will be responsible for ensuring that one maintain an excellent level of technical knowledge regarding all areas Digital Media\n will be responsible for delivering regular training to the Business Development and Account Management Teams in both selling and technical knowledge\n will work closely with the marketing team to identify event opportunities\n\nCandidate Profile Knowledge\n Have worked in a multi-customer environment\n Demonstrable track record in delivering technological environments. Highly\n\nanalytical in problem-solving with the ability to apply original and innovative thinking\n Display and apply knowledge of technologies\n Proven track record in Enterprise IT sales\n\nSkills\n Thorough knowledge of managing teams and personnel\n Understanding and Knowledge of techno commercials aspects of business\n Knowledge of Managing Customers and relationships\n A high level of oral and written communication skills in order to communicate\n\neffectively with senior managers, colleagues and other stakeholders\n Ability to research subjects, with a commitment to provide continuous improvement\n To work under pressure and think clearly in challenging situations in a logical manner\n To be flexible in approach and be comfortable with a fluid organizational structure that requires both teamwork and self-sufficiency as necessary, with the ability to work under minimal supervision\n\nMinimum Qualifications\n Bachelor's Degree in Telecommunications (Preferable but not necessary),"
    },
    {
        "Job Title": "IT Recruiter (Domestic)",
        "Company Name": "Intelliest Technology Pvt. Ltd.",
        "Location": "Other West Bengal",
        "Salary": "Not Disclosed",
        "Experience": "2 to 6 Yrs",
        "Job Description": "Company Description\n\nIntelliest Technology Pvt. Ltd. is a staffing company based in Kolkata metropolitan area. The company partners with top market players from diverse segments for SAP, web technologies, Fintech, etc. with a focus on providing niche, high-end manpower solutions. Intelliest aims to set a benchmark in the staffing industry with their values of Quality, Speed and Transparency. They strive to provide optimum value for their clients by delivering specialized talents in tough-to-hire segments and promise the best opportunities, right skill development tools, optimum resources, and a transparent work culture to enrich the lives of their employees and associates.\n\nRole Description\n\nThis is a full-time on-site role for an IT Recruiter (Domestic). The IT Recruiter will be responsible for full-life cycle recruiting, IT recruitment, technical recruiting, hiring, and recruiting.\n\nQualifications\n Full-life Cycle Recruiting, IT Recruitment, Technical Recruiting, Hiring, and. Recruiting skills\n Excellent communication, interpersonal, and analytical skills\n Experience in working with recruitment tools and techniques\n Ability to work in a team and under pressure\n Bachelors or Masters degree in Human Resources, Business Administration, or related field\n Experience in the IT industry is a plus,"
    },
    {
        "Job Title": "IT Support Specialist and Office Admin",
        "Company Name": "BeyondeBiz Consulting Pvt Ltd",
        "Location": "All India",
        "Salary": "Not Disclosed",
        "Experience": "1 to 5 Yrs",
        "Job Description": "We are looking for a talented and motivated IT Support Specialist and office admin to join our team!\n\nAs an IT Support Specialist and office admin, you will be responsible for providing technical support to our clients, providing administrative support to our staffs and clients. Should have a strong understanding of IT systems and be able to troubleshoot and resolve a wide range of issues and perform web application testing across different platforms and devices. In addition, you should have knowledge of Plesk and be able to confidently manage web hosting tasks.\n\nResponsibilities:\n Early morning start from home at 3:30 AM IST (9 AM AEDT) October to March, 4:30 AM IST (9 AM AEST) April to September, reach office at 7 AM IST to work with team\n Managing incoming emails, follow up with Clients and Techs\n Manage Jobs like Create Job, Schedule Job, Book Jobs for Technician\n Provide technical support to clients via phone, email, and in person\n Provide administrative support to staff and. management and handling correspondence (email, phone calls, etc.)\n Be the first point of contact for client enquiries received via email\n Answer and manage client calls, providing prompt and accurate status\n Design and execute comprehensive test plans for various features and functionalities\n Conduct QA testing across different platforms and devices\n Identify, document, and report bugs and defects clearly and concisely\n Collaborate with developers to reproduce and resolve issues effectively\n Manage Plesk web hosting control panels, including creating and managing websites, email accounts, and databases\n Migrate websites from one server to another, ensuring minimal downtime and data loss\n Update and maintain DNS records for websites and domains\n Document and track all support tickets and issues\n Stay up-to-date on the latest IT trends and technologies\n Perform other duties as assigned\n\nQualifications:\n Minimum of 1 years of experience as an IT Support Specialist, office admin or similar role\n Familiar with working on Plesk control panels\n Strong understanding of web hosting concepts and technologies\n Excellent troubleshooting and problem-solving skills\n Effective communication and interpersonal skills\n Ability to work independently and as part of a team\n Detail-oriented and organized\n Meticulous attention to detail and a passion for quality.\n\nBenefits:\n\n Competitive salary and benefits package.\n\n Opportunity to work in a collaborative and supportive team environment.\n\n Be a part of a growing and innovative company.\n\n Make a real impact on the success of BeyondeBiz and its clients.\n\nJob Type: Full-time\n\nSalary: 10,000.00 - 20,000.00 per month\n\nBenefits:\n Paid sick time\n\nSchedule:\n Morning shift\n\nExperience:\n Microsoft Office: 1 year (Preferred)\n total work: 1 year (Preferred)\n\nAbility to Commute:\n Manewada, Nagpur, Maharashtra (Required)\n\nAbility to Relocate:\n Manewada, Nagpur, Maharashtra: Relocate before starting work (Required)\n\nWork Location: In person,"
    },
    {
        "Job Title": "IT Sales- Executive",
        "Company Name": "Latent",
        "Location": "Other Maharashtra",
        "Salary": "Not Disclosed",
        "Experience": "3 to 7 Yrs",
        "Job Description": "About Us:*\n\nWe are a dynamic and innovative IT solutions provider, specializing in cutting-edge technologies and tailored solutions for our clients. With a commitment to excellence, we are seeking a motivated and results-driven IT Sales Executive to join our expanding team. This role involves engaging with clients in the field, showcasing our capabilities, and driving successful project conversions.\n Responsibilities:*\n\n- Conduct field meetings with potential clients to understand their IT needs and challenges.\n\n- Present our company's services and solutions in a compelling manner.\n\n- Build and maintain strong relationships with clients, understanding their business goals.\n\n- Collaborate with the internal team to develop customized proposals and project plans.\n\n- Proactively identify opportunities for upselling and cross-selling our services.\n\n- Achieve and exceed sales targets through effective negotiation and closing techniques.\n\n- Keep abreast of industry trends and competitors. to provide valuable insights to clients.\n\n- Provide regular updates on sales activities and progress to the sales manager.\n Requirements:*\n\n- Proven experience in IT sales, with a track record of meeting or exceeding sales targets.\n\n- Strong communication and presentation skills, with the ability to articulate technical concepts to non-technical clients.\n\n- Previous experience in field sales, client meetings, and relationship building.\n\n- Ability to work independently and as part of a collaborative team.\n\n- Excellent negotiation and closing skills.\n\n- Familiarity with IT services and solutions is a plus.\n Qualifications:*\n\n- Bachelors degree in Business, Marketing, or a related field.\n\n- Minimum of 3 years of experience in IT sales.\n\n- Knowledge of the local market and industry trends.\n Benefits:*\n\n- Competitive salary with performance-based bonuses.\n\n- Opportunities for career growth and professional development.\n\n- Dynamic and collaborative work environment,"
    },
    {
        "Job Title": "IT Support Specialist",
        "Company Name": "Hilti India",
        "Location": "Other Haryana",
        "Salary": "Not Disclosed",
        "Experience": "1 to 5 Yrs",
        "Job Description": "About Hilti India\n\nHilti India is a marketing organization of the Hilti Group, a Swiss multinational that develops, manufactures, and markets products for construction, building maintenance, and energy & industries, mainly to the professional end-user. It manufactures and markets an array of fastening & anchoring systems, power tools, and firestop installation systems. With some 32,000 people in more than 120 countries, were a great place for you to show us your worth as you learn, grow, and carve out your career.\n\nKey Responsibilities\n * Provide onsite troubleshooting and handling user requests through ticketing, email, and phone calls in a timely manner within the agreed SLA and processes in AU\n * Administer Microsoft users using Active Directory and software distribution tools\n * Support PC / laptop/tablets /mobile data/smartphones/network equipment\n * Provide onsite support for Global IT for servers and network components\n * Provide onsite support to configure network. printers in accordance with Global IT standards\n * Support MS Office 365 cloud and client applications\n * Asset management of Hilti IT equipment and mobile phones using software and tools provided\n * Coordinate local projects for Global IT rollout\n * Compliance with all relevant regulations and company agreements\n * Provide out-of-hours support when and if required\n * May be required to travel to sites in the country\n * This will be a Complete In-office profile and no WFH is there.\n\nFunctional Expertise\n * Strong PC, laptop, and tablet hardware support experience\n * Knowledge and experience of Microsoft Windows Microsoft Windows OS, Microsoft Office, and PC hardware/software/tools, network troubleshooting (LAN and TCP / IP) and IT hardware\n * Good supportive telephone manners and communication skills\n * Self-motivated team member\n\nWhat do we not need\n * Programming language skills\n * Server administration\n * Not enthusiastic about finding the best possible solution for the users.\n * Weakness in teamwork or interpersonal cooperation/communication\n\nNon-negotiable criteria\n * 1-2 years of experience\n * Experienced in installing and maintaining PC / laptop / tablet.\n * CCNA Certified or Network related knowledge is must.\n * Hands-on experience with MS Office Applications.\n * Driving license\n * Excellent communication skills in written and spoken English is a must.\n\nAbout Company: Hilti India is a marketing organization of the Hilti Group, a Swiss multinational that develops, manufactures, and markets products for the construction, building maintenance, and energy industries, mainly to the professional end-user. It manufactures and markets an array of fastening and anchoring systems, power tools, and firestop installation systems. We have a proud heritage built over 75 years and a reputation for pioneering products and exceptional services,"
    },
    {
        "Job Title": "HR (IT Recruitment Specialist)",
        "Company Name": "intellinez",
        "Location": "Other Punjab",
        "Salary": "Not Disclosed",
        "Experience": "2 to 6 Yrs",
        "Job Description": "Job ID\nIS-036\n\nJob Role\nIT Recruitment Specialist\n\nJob Designation\nHR\n\nJob Location\nMohali  Punjab\n\nDesired Job Experience\n2  5 Years\n\nDesired Qualification\nMBA | Master Degree\n\nSalary\nNegotiable | Best in Industry\n\nJob Description:\n\nWe are looking for a strong leader who can help us drive our recruitment process and help hire the best talent in the industry.\n\nYou will need to work with technical teams to gather requirements, build appropriate JDs, post talent requirements, and hire the best candidate.\n\nThe ideal candidate for this role must have proven experience in the IT recruitment field. He/She must possess excellent verbal and written communication appropriate to engage with all levels. Must be a great leader who takes pride in and genuinely enjoys hiring, developing, mentoring, motivating, and retaining the best engineers and creating outstanding teams.\n\nDesired Skills:\n IT recruitment experience\n Must have lead teams for other IT recruiters\n Candidate onboarding process experience\n Candidate separation process experience\n\nDesired Competencies:\n Must possess excellent written and oral English skills.\n Must possess excellent learning skills.\n Must be a great communicator and have ability to present his thoughts and communicate it clearly.\n Must be passionate about learning and possess proven learning skills.\n Must be proactive.\n Ability to handle complex projects independently.\n Must be obsessed with quality work.\n Must possess deep analytical and troubleshooting skills and a never give up attitude on assigned problems and tasks.\n Must have an attitude to serve customers and teammates.\n Must be a team player.\n Must possess desire to grow personally and professionally and be ready to put in the required efforts.\n Must be passionate about getting things done and should possess a confident attitude.\n Must be ready to put in the efforts whenever needed and go beyond protocols to support the team.\n Should be ready to train and develop junior resources and create an efficient team as needed.\n\nNote: This is a general job description, it can be modified to suit the needs of the company.\n\nOur Pro Employee Policies\n Annual Bonus\n Company sponsored trainings and certifications\n Extensive medical insurance coverage.\n Company sponsored wellness programs & access to gym and swimming facilities.\n Periodic Rewards & Recognition\n\nWhy Join Intellinez Systems \n Exceptional Employee Benefits.\n People-Centric Work Culture\n Global Exposure\n Learning Opportunities\n Exceptional Career Growth\n Regular Rewards & Recognition\n Extensive Wellness Programs\n\nDeveloper: Full Time\n\nLocation: Mohali\n\nPosted on: 08 May, 2023,"
    },
    {
        "Job Title": "IT Audit (Global Markets) - Senior Manager",
        "Company Name": "Jobs via eFinancialCareers",
        "Location": "All India",
        "Salary": "Not Disclosed",
        "Experience": "8 to 12 Yrs",
        "Job Description": "Who We Are Looking For\n\nThe Business Aligned IT Auditor will be responsible for working on audit engagements that focus on business risk and related application technology for specific business divisions and/or functions. Team members work to understand business risks and related IT general controls, including interface controls, logical access controls, change management, backup and recovery, and application controls (e.g systematic validations, interfaces). The main objective of an audit is to provide management with independent, objective assurance regarding the design and operating effectiveness of the system of internal controls to mitigate both business and IT-related risks. The audit follows a collaborative approach, with business and IT audit team members jointly conducting the majority of internal and client-facing planning, control assessment, testing, and reporting activities. In this role you will be based in Toronto, Canada.\n\nWhy this role is important to us\n\nThe team you will be joining plays an important role in the overall success of the organization. Across the globe, institutional investors rely on us to help them manage risk, respond to challenges, and drive performance and profitability. To make that happen we need teams like yours to help navigate employees and the organization as a whole. In your role you will strive for cutting-edge solutions, that are straightforward and scalable. You will help us build resilience and execute day to day deliverables at our best. Join us if making your mark in the financial services industry from day one is a challenge you are up for.\n\nWhat You Will Be Responsible For\n\nAs an IT Audit Officer you will\n Perform audit work as assigned, leveraging Corporate Audit's risk based methodology to assess risks and controls and validate the adequacy of the design of controls.\n Devises effective and efficient tests of key controls, executes and documents audit tests and concludes on the effective operation of controls.\n Take part in audit scoping procedures, specifically Identification of IT dependencies.\n Assist in leading control walkthroughs and executing controls assessments.\n Executing testing of IT general and automated application controls\n Coach less experienced staff.\n Stay abreast of industry and technical matters and efficiently and effectively apply applicable new developments in audit projects.\n\nWhat We Value\n\nThese skills will help you succeed in this role\n Motivated self-starter and intellectual curiosity.\n Excellent analytical, written communication, interpersonal, organizational and presentation skills.\n Detail and deadline oriented.\n Ability to establish an environment conducive to continuous innovation\n Ability to multi-task in a fast paced environment.\n Ability to comprehend both technology and operational risks.\n IT General Controls testing experience (user administration, business continuity /disaster recovery, system development lifecycle controls)\n Application Controls assessment and testing experience (data input and validation controls, validation of system processing through technics such as review of UAT / QA testing documentation, data interface testing, etc.)\n\nEducation & Preferred Qualifications\n Experience in the following areas is desirable: Financial Services processes and technology, Oracle E-Business Suite, Database Technology, Technical application background.\n Bachelor's Degree in Accounting, Finance, Business Administration, Management Information Systems, or Computer Science, Information Assurance or related field.\n CISA, CPA, CIA or other applicable certification preferred.\n 8-10 years of experience in Public Accounting, IT Audit, Consulting, or Business Process Engineering preferred, ideally in the Financial Services industry.\n\nAdditional Requirements\n\nTravel up to 15% may be required.\n\nAre you the right candidate  Yes!\n\nWe truly believe in the power that comes from the diverse backgrounds and experiences our employees bring with them. Although each vacancy details what we are looking for, we don't necessarily need you to fulfil all of them when applying. If you like change and innovation, seek to see the bigger picture, make data driven decisions and are a good team player, you could be a great fit.\n\nAbout State Street\n\nWhat we do. State Street is one of the largest custodian banks, asset managers and asset intelligence companies in the world. From technology to product innovation, we're making our mark on the financial services industry. For more than two centuries, we've been helping our clients safeguard and steward the investments of millions of people. We provide investment servicing, data & analytics, investment research & trading and investment management to institutional clients.\n\nWork, Live and Grow. We make all efforts to create a great work environment. Our benefits packages are competitive and comprehensive. Details vary by location, but you may expect generous medical care, insurance and savings plans, among other perks. You'll have access to flexible Work Programs to help you match your needs. And our wealth of development programs and educational support will help you reach your full potential.\n\n\nState Street is an equal opportunity and affirmative action employer.\n\nDiscover more at StateStreet.com/careers,"
    },
    {
        "Job Title": "Senior IT Specialist",
        "Company Name": "Loopio",
        "Location": "All India",
        "Salary": "Not Disclosed",
        "Experience": "3 to 7 Yrs",
        "Job Description": "Loopio is a workplace that unleashes learning & growth opportunities for our Loopers. We provide autonomous, challenging work that allows each employee to master their craft. We attract and retain people who are naturally curious, have grit and are eager to grow and build their careers. At Loopio, we genuinely support each other, because true success comes from working as #oneteam. We are looking for a passionate Senior IT Specialist to support all aspects of our IT operations and infrastructure. This role will look to resolve day-to-day IT requests and support onboarding and offboarding initiatives. You will be joining the team of talented Information Technology Professionals on a mission to support and enable every team at Loopio through the use of technology best practices, automation and modern day technology products. Our IT environment and technology stack is continuously evolving at Loopio and If you are looking for opportunities to collaborate with team members, improve your mastery, and enjoy working in a fast paced collaborative environment, you should definitely apply! This role requires close collaboration with teams across Canada, the UK, and India. To accommodate the time zone differences, you will be expected to work from 12 - 8 pm IST. What You'll Be Doing\n Act as the main point of contact for all IT related questions\n Lead onboarding initiatives for new hires and employee off-boardings\n Working with all departments to find the best solution for day-to-day IT requirements\n Work with the IT team to resolve Helpdesk tickets\n Contribute to building the IT infrastructure and IT Documentation Database\n Keep an up-to-date IT Asset list\n Project based work including hardware and software implementation\n\nWhat You'll Bring to the Team\n 5+ years experience in a help desk or IT-related role\n 3+ years experience with Apple Devices & MacOS administration\n 3+ years experience with a CRM or IT Ticketing System\n Experience with SaaS Software Administration\n Experience with Endpoint Protection Administration\n Experience with Mobile Device Management Software\n\nBonus Qualifications\n Single-Sign-On (SSO) SAML Administration\n Experience with OneLogin or Okta\n Experience with VPN technologies\n Understanding of networking concepts\n Work experience in a SaaS Software Company\n\nWhere You'll Work\n Loopio is based in Canada with hub regions around the world. Right now, our employees (or Loopers, as we call ourselves!) live and work in Ahmedabad, Pune, Mumbai, Bengaluru, Toronto, Vancouver, and London (UK)\n Loopio is a remote-first workplace because we recognize the advantages of working flexibly. Our India hub employees live and work remotely within Gujarat, Maharashtra, and Bengaluru and work 12am - 8:00pm IST unless otherwise stated.\n Youll collaborate with your teams virtually across India, UK and North America (were just a Zoom call and Slack message away!) and have established core sync hours and focus time during the workday to enable us to work smarter together. Additionally, we encourage asynchronous collaboration to effectively work as a global #OneTeam!\n\nWhy You'll Love Working at Loopio\n Your manager supports your development by providing ongoing feedback and regular 1-on-1s\n You have tons of autonomy and responsibility: this role provides an opportunity to try new things and push creative boundaries\n Youll learn more than you thought was possible; our team is obsessed with personal and professional growth (every Looper receives a professional mastery allowance each year)\n Youll be set up to work remotely with a MacBook laptop, a monthly phone and internet allowance, and a work-from-home budget to help get your home office all set up!\n Join us in regular company socials, AMA (Ask-Me-Anything), and quarterly kick-off to celebrate the big wins and milestones as #oneteam!\n Youll be joining a culture that has thoughtfully built out opportunities for connections in a remote first environment\n We have Employee Resource Groups, House Teams (curious  ask us about it!), virtual yoga, cooking classes and many more moments for us to have fun and learn together!\n Youll be a part of an award-winning workplace and one of Canadas fastest growing companies with ample opportunity to make a big impact here!\n\nWe recognize that all too often, potential candidates dont apply for a position simply because they dont hit every single criteria included in the job descriptionparticularly members of underrepresented groups. Whether or not your experience checks off all the boxes on a job posting, we still encourage you to apply to ensure that your application receives a review from our team. We understand that a resume can only showcase so much during the applicant stage, so we've created prompts in the application for you to share more about yourself. If you've made a career transition (or a few!), youre self taught in a new role, or you have skills/experience youd like to highlight, we want to hear more about what you could bring to the table. Loopio is an equal opportunity employer that is deeply committed to building equitable workplaces that are diverse and inclusive. We actively encourage candidates from all backgrounds and lifestyles to consider us as a future employer. Please contact a member of our Talent Experience team (hidden_email) should you require accommodations at any point during our virtual interview processes.,"
    },
    {
        "Job Title": "Lead IT Recruiter",
        "Company Name": "AVSAR",
        "Location": "Other Haryana",
        "Salary": "Not Disclosed",
        "Experience": "3 to 7 Yrs",
        "Job Description": "Job Title: Team Lead, IT Recruitment\n\nLocation: Gurgaon  Sec -65, Suncity Success Tower.\n\nJob Type: Full Time\n\nJob Summary: The Team Lead, IT Recruitment will oversee the recruitment operations for IT positions, ensuring the acquisition of top talent to meet the company's needs. This role involves strategic planning, team management, and hands-on recruitment activities to build a strong IT workforce.\n\nKey Responsibilities\n Leadership and Management:\n Lead, mentor, and manage a team of IT recruiters.\n Set performance goals and conduct regular performance evaluations.\n Provide training and development opportunities for team members.\n Foster a collaborative and high-performance team environment.\n Recruitment Strategy:\n Develop and implement effective recruitment strategies to attract top IT talent.\n Collaborate with hiring managers to understand staffing needs and create job descriptions.\n Stay updated with industry trends and best practices in IT recruitment.\n Talent Acquisition:\n Manage the full recruitment lifecycle, from sourcing and screening to interviewing and hiring.\n Utilize various sourcing methods, including job boards, social media, and networking, to attract candidates.\n Conduct interviews and assessments to identify the best candidates for each role.\n Ensure a positive candidate experience throughout the recruitment process.\n Data and Reporting:\n Monitor and analyze recruitment metrics to measure effectiveness and identify areas for improvement.\n Prepare regular reports on recruitment activities, pipeline status, and hiring progress.\n Use data-driven insights to refine recruitment strategies and processes.\n Employer Branding:\n Promote the companys employer brand and value proposition to potential candidates.\n Participate in job fairs, industry events, and other networking opportunities to build a talent pipeline.\n Develop relationships with universities, technical schools, and professional organizations.\n\nQualifications\n Bachelor's degree in Human Resources, Business Administration, or a related field.\n Proven experience in IT recruitment, with a track record of successfully filling technical positions.\n Previous leadership or team management experience preferred.\n Strong understanding of IT roles and technologies.\n Excellent communication and interpersonal skills.\n Ability to work in a fast-paced and dynamic environment.\n Proficiency in using applicant tracking systems (ATS) and recruitment software.\n Strong organizational and time-management skills.\n\nDesired Skills\n Strategic thinking and problem-solving abilities.\n Experience with employer branding and talent marketing.\n Familiarity with data analysis and recruitment metrics.\n Strong networking skills and ability to build relationships with potential candidates.,"
    },
    {
        "Job Title": "Information Technology (IT) Service Desk Analyst - Level 1",
        "Company Name": "Meltwater Group",
        "Location": "All India",
        "Salary": "Not Disclosed",
        "Experience": "1 to 5 Yrs",
        "Job Description": "Description\n\nPlease only Apply if you reside in Bangalore or will 100% Relocate\n\nAs the front line of Meltwater ITs Service Desk, the ITSDA Tier 1 team members will be responsible for immediate ticket triage, categorization, urgency clarification, and routing. Onboarding and offboarding duties, asset management and some ticket troubleshooting are also part of this role.\n\nKey Responsibilities:\n Work in a 24-hour shift pattern (rotating 8-hour shifts with a 24x7 team) to provide Tier 1 IT support\n Triage tickets, initiate troubleshooting and ultimately route them with the appropriate urgency and categorization as required.\n Responsible for ensuring assigned tasks are completed within Service Level Agreements (SLA)\n Escalate tickets as and when required in a timely manner\n Communicate initial ticket expectations to employees.\n Contribute to the on and off-board process for employees and contractors.\n Manage the Employee Transfer Process internally for our systems\n Administration of Email and Active Directory\n Manage shipping and return of available assets from stock\n Track all work and document records of action performed\n Document resolutions and update Knowledge bases with approval of Tier 1 manager\n Participate in all service desk activities with a view to continuously improving service\n Provide high-level customer service to employees\n\nSkills & Technology Experience Required:\n Minimum 1 year experience in an IT troubleshooting, customer-facing role\n Ability to effectively manage large ticket volumes\n Excellent problem-solving and analytical skills\n Strong research and troubleshooting techniques\n Respond promptly and multitask effectively\n Strong customer service ethics\n Be a Team Player\n Windows and Mac OS experience\n Active Directory Experience (create, move & delete users)\n Experience in Microsoft applications including O365, Exchange\n Experience with Cloud apps such as Adobe/Google\n Knowledge of Microsoft Word, Excel, and PowerPoint\n Basic Network/VPN troubleshooting experience\n Experience with Service Desk Ticketing Systems\n Exposure to Intune and Jamf MDM environments\n Exposure to the Azure platform\n Previous experience with On/Offboarding processes (preferred)\n Knowledge of the ITIL Framework (preferred)\n Experience supporting Telephony Systems and IM systems (preferred)\n\nBenefits of working at Meltwater\n Flexible Paid Time Off\n Maternity and paternity allowances\n Wellness allowance\n Internet allowance\n Brilliant team dynamic\n Constant technical and soft skills training and development\n Open door policy from the management team\n\nAbout Meltwater\n\nWith 20 years of experience in the field of online media monitoring, Meltwater is a global leader in media intelligence and social analytics SaaS solutions - helping to bridge the gap between Public Relations, Communications, and Marketing departments with an all-in-one solution powered by AI-driven insights.\n\nThrough Meltwater's platforms, our clients are well equipped to stay on top of billions of online conversations and extract relevant insights - allowing them to strategically manage their brands and stay ahead of their competition. Over 30,000 of the worlds most respected brands rely on Meltwater to help inform their marketing & communications strategies and executive decision making. With over 55 offices and 2,000 employees worldwide, Meltwater is a truly global partner offering best-in-class support through our local customer success teams.\n\nMeltwater employees embody the work-hard, play-hard spirit through our 3 core values - Moro (fun), Enere (number one) and Respekt (respect). These founding principles stem from our Norwegian roots and are why Meltwater has been named a Great Place to Work in several markets across the globe. We have high energy, open concept offices that thrive on teamwork and collaboration. We ensure our employees have easy access to management and learn quickly from those around them.,"
    },
    {
        "Job Title": "14296279 - ServiceNow IT Service Management",
        "Company Name": "Trigent Software Inc",
        "Location": "All India",
        "Salary": "Not Disclosed",
        "Experience": "2 to 6 Yrs",
        "Job Description": "Level\n 11\n 11 HDC4 Summary: As an Application Designer for Cloud Migration & Implementation, you will be responsible for assisting in defining requirements and designing applications to meet business process and application requirements related to ServiceNow IT Service Management. Your typical day will involve collaborating with cross-functional teams, analyzing business requirements, and designing solutions to meet those requirements. Roles & Responsibilities:\n Collaborate with cross-functional teams to analyze business requirements and design solutions to meet those requirements.\n Assist in defining requirements and designing applications to meet business process and application requirements related to ServiceNow IT Service Management.\n Develop and maintain technical documentation related to application design and implementation.\n Provide technical guidance and support to development teams during the implementation phase. Professional & Technical Skills:\n Must To Have Skills: Strong understanding of ServiceNow IT Service Management.\n Good To Have Skills: Experience with ServiceNow IT Operations Management.\n Experience in designing and implementing ServiceNow IT Service Management solutions.\n Experience with ServiceNow scripting, including Business Rules, Client Scripts, and UI Actions.\n Experience with ServiceNow integrations using REST and SOAP APIs. Additional Information:\n The candidate should have a minimum of 2 years of experience in ServiceNow IT Service Management.\n This position is part of the Software Engineering job family group.\n This position is based at our Coimbatore office.,"
    },
    {
        "Job Title": "IT Admin",
        "Company Name": "Butterfly Groups",
        "Location": "Other Tamil Nadu",
        "Salary": "Not Disclosed",
        "Experience": "2 to 6 Yrs",
        "Job Description": "Work Location : Coimbatore Shift : Rotational Work Mode: Office Exp : 2-4 Years REQUIREMENT  Good knowledge of multiple operating systems and system administration skills (Windows, Linux)  Good knowledge of virtualization (VMware, HyperV, Citrix)  Experience in software management installations, patching of OS/apps (Linux)  Experience in OS File System Management, File Permissions, and Performance Monitoring  Experience in Linux Server administration, Strong analytical and problem -solving skills  Experience in Installing, configuring, and managing the MySQL, MSSQL, and MongoDB databases  Experience in IIS, Tomcat, Apache http, SSL, and HAProxy  Experience in Storage (SAN/NAS/DAS/Cloud Storage) administration and provisioning  Experience in large-scale networking, DNS, SSH, TCP/IP, VLANs, DHCP, VPN, Routing, and ACLs  Good knowledge of Networking and UTM Firewall  Experience with cloud technologies such as AWS or Microsoft Azure  Experience with containerization such as Docker or similar  Coordinates the implementation of the Information Security Policies  Plan and coordinate Internal Audits to verify adherence to the Information Security Policies and Procedures across the organization yearly  Coordinate periodic awareness of the implemented policies and create awareness documents  Coordinate, Review, and Maintain track of Information Security Incidents  Manage and maintain records of the Management Review Meeting for Compliance  Review Information Security Incidents issues. COMPETENCIES  Data Security  Incident Management  IT Security Training and Awareness  IT Systems Operations and Maintenance  Regulatory and Standards  System and Application Security QUALIFICATIONS  Any bachelors degree or an equivalent degree is an advantage  Should have worked in the Information Security Management System  2 to 4 years of relevant experience is required  Should be Proficient in MS Office (Excel, Word, Visio, and PowerPoint), and if the candidate has knowledge of a variety of programs that is an added advantage OTHER REQUIRED SKILLS  Good communication (both verbal and written) and interpersonal Skills  A proactive approach to work and a willingness to help others use IT effectively  The ability to work independently as well as part of a team  The ability to own priorities and be responsible for your workload  A good decision-maker and diligent in the execution of tasks\n\nJob Types: Full-time, Permanent\n\n\nJadwal:\n Day shift\n\nExperience:\n total work: 2 years (Required)\n\nWork Location: In person,"
    },
    {
        "Job Title": "IT Support Engineer",
        "Company Name": "SMS-Magic",
        "Location": "Other Maharashtra",
        "Salary": "Not Disclosed",
        "Experience": "3 to 7 Yrs",
        "Job Description": "Position Summary:\n\nWe are seeking an experienced IT Support Engineer with 3 to 7 years of experience to join our team. The ideal candidate will have a strong background in providing support for both Mac book and Windows laptop users, along with expertise in inventory management, asset management, ticketing tools, IT helpdesk, remote support, asset compliance, policies, and networking.\n\nResponsibilities:\n Provide technical support for Macbook and Windows laptop users, resolving hardware and software issues promptly\n Manage inventory of IT equipment, including laptops, peripherals, and other devices\n Maintain accurate records of all IT assets, ensuring compliance with company policies\n Utilize ticketing tools to track and priortize support requests, ensuring timely resolution\n Provide IT helpdesk support to end-users, both in-person and remotely\n Ensure compliance with IT asset management policies and procedures\n Collaborate with the networking team to troubleshoot and resolve. network issues\n\nQualifications:\n Bachelor's degree in Computer Science, Information Technology, or related field\n 3 to 7 years of experience in IT support roles\n Strong knowledge of Macbook and Windows operating systems\n Experience with inventory management and asset management systems\n Proficiency in ticketing tools such as ServiceNow, JIRA, or similar\n Excellent communication and interpersonal skills\n Ability to work independently and as part of a team\n New Office set up including camera configurations and biometric installations will be a plus\n\nPowered by JazzHR\n\ndU4gque0od,"
    },
    {
        "Job Title": "US IT Recruiter",
        "Company Name": "BerklySoft",
        "Location": "Chennai",
        "Salary": "Not Disclosed",
        "Experience": "3 to 7 Yrs",
        "Job Description": "Position : US IT Recruiter\n\nPrimary Skills : Exp in both W2 and C2C Requirement\n\nLocation : Chennai (Local Candidates preferred)\n\nJob Description :\n Must have a minimum of 3+ years of experience with US IT Recruitment\n Understand the client requirements, Sourcing Strategy/ Plan for various requirements\n Source Right-Fit candidates from various sources such as Job Portals, Networking Sites, References, Applications on Company Website and others.\n Evaluate the profiles, shortlist and submission of right fit profiles to clients.\n Negotiate with candidates and follow through activities till on-boarding of the candidates as per the offer conditions of the client.\n Must have strong experience in both C2C, 1099 and W2 hiring\n Experience with SAP, Salesforce, Hybris preferred.\n Strong communications and interpersonal skills\n\nThank you\n\nAbirami | Berklysofthidden_email,"
    },
    {
        "Job Title": "US & Domestic IT recruiters (Background- IT staffing company only)",
        "Company Name": "Himflax Group",
        "Location": "Noida",
        "Salary": "Not Disclosed",
        "Experience": "2 to 6 Yrs",
        "Job Description": "Company Description\n\nHIMFLAX GROUP is a CMMI Level 5 & MWBE-certified organisation offering IT and Staff augmentation Solutions, including Software consulting, development, and maintenance. The company combines passion and innovation to bring real value to clients in the USA, Canada, India and UAE, with a focus on maintaining confidentiality, providing unbiased views, and making IT implementation an affordable and profitable journey.\n\nRole Description\n\nThis is a full-time on-site role for a US & Domestic IT Recruiters at HIMFLAX Group located in Noida. The IT Recruiters will be responsible for full-life cycle recruiting, IT recruitment, hiring, technical recruiting, and screening out best suitable profiles.\n\nQualifications\n Experience in full-life cycle IT recruiting and technical recruiting.\n Expertise in IT recruitment and general hiring practices.\n Strong communication, interpersonal, and negotiation skills.\n Ability to handle multiple requisitions simultaneously and work under. pressure.\n Bachelor's degree in Human Resources, Computer science, or related field.\n Experience with applicant tracking systems and recruitment technologies.\n Knowledge of employment laws and regulations.\n\nA candidate should possess the following skills:\n Full-life Cycle Recruiting skills\n IT Recruitment skills\n\nRelevant skills and qualifications that would be beneficial:\n Experience in staffing and recruiting for IT consultancies or technology companies\n Ability to utilize social media and other digital resources to attract top talent\n Certifications such as the Professional in Human IT Resources or Senior Professional in Human Resources (SPHR)\n\nThe job description should be concise and avoid repeating phrases or sentence structures,"
    },
    {
        "Job Title": "Head - IT & Digital Transformation",
        "Company Name": "UNISON INTERNATIONAL CONSULTING (The Recruitment Company)",
        "Location": "Delhi",
        "Salary": "Not Disclosed",
        "Experience": "15 to 19 Yrs",
        "Job Description": "Technology is the core of any business, and the objective of the role will be to completely disrupt, challenge the status quo and deliver superior consultant/ customer and organisation value in Direct Selling.\n Delivery - Own end to end technology delivery and operations of high-performance enterprise business applications, web and mobile applications. Architecting and scaling technology platform to reduce technical debts and improve performance and agility. Create high impact and high energy teams that deliver constant improvements across the 3 layers, defining new technology journeys/ deliverables, meet timelines for all stake holders.\n Drive Innovation - Develop and drive technology strategy and innovation that aligns with companys ambitious business goals and amplifies growth.\n\nRoles & Responsibilities\n Lead Digital Transformation\n Study and evaluate the current IT systems\n Propose new integrated IT system, investments and resources needed for the Business with a road map\n. Achieve high levels of efficiency in making good returns vis--vis the investment made\n Analyzing latest IT concepts/trends and update the organization where company can derive benefits\n Should have the capability to understand and analyse business problems and their IT solutions\n Ensuring the implementation of projects across organisation within the desired timelines and project costs.\n\n Be a champion of change, optimising current IT solutions whilst promoting innovative solutions to operational challenges\n\n Direct development and execution of an enterprise-wide information security plan that protects the confidentiality, integrity, and availability of the company's data and servers\n\n Support the marketing process by providing implementation of technical requirements for Internet marketing and search engine optimization.\n\n Establish and monitor a web analytics regime that measures performance to goals\n\n Maintain up-to-date knowledge of technology standards, industry trends, emerging technologies, and software development best practices by attending relevant conferences and reading.\n\n Apply a structured methodology and lead change management activities. Prepare and implement project plans to achieve the desired outcomes.\n\n Drive software compliance of all organisation function\n\n Create and manage high performance IT team, IT infrastructure and operations across organisations functions to meet the business IT needs.\n\n Procure, negotiate, manage and monitor of contracts for IT services provided by third parties ensuring effective service delivery.\n\n Continue strategic approach, innovation, and best practices in the use of technology and IT.\n\n Lead and manage technical team with clear structure and processes for the department\n\n Oversee outsourced software development relationships, development and delivery.\n\n Work with all other intra departments within the organisation to get maximum return\n\n Ability to see potential business areas where IT can enhance competitiveness, effectiveness, and efficiency besides creating a differentiator.\n\n To analyse the Current and Future Information technological needs of the organization.\n\n To Recognize New Developments in Information Systems and establish current and long-term needs for the organization.\n\n IT policies formation, implementation and monitoring\n\n To develop and maintain positive relationships with key partners and stakeholders.\n\n To ensure effective management of staff and resources promoting team building and collaborative working to deliver the corporate plan\n\n To provide clear, succinct, and cogent reports to required deadlines for the Board, Committees, the Chief Executive, Management Teams and key stakeholders as required.\n Lead and deliver the implementation of a new integrated IT system (ERP) in organisation business.\n\nLeadership Skills\n\n Display high levels of ambition to see the business scale 10 fold.\n Adaptability  able to navigate changing landscape, business needs effectively\n Ability to take decisions by evaluating trade-offs across multiple options between maintaining fast IT project delivery cycles and maintaining high quality/scale.\n Interface with business to define requirements, deliverables, and provide the necessary technology expertise & support to ensure on-time delivery of projects.\n Excellent communication and collaboration skills.\n Continuously work with multiple cross-functional stakeholders in various departments. Evangelise the technology prowess of the company by helping with in branding and marketing company as a major tech enabled direct selling player and employer.\n\nQualifications/ Technical Experience\n Atleast 15+ years experience of leading, conceptualizing and delivering technology solutions\n Should have led IT and Digital Transformation for a highly data intensive 24 x 7 business.\n Prior experience in Consumer /E-commerce industry preferred\n Ability to Multi-Task in an ambiguous and very dynamic & transforming environment,"
    },
    {
        "Job Title": "Business Development Manager- IT",
        "Company Name": "VIT Infotech",
        "Location": "Other Karnataka",
        "Salary": "Not Disclosed",
        "Experience": "3 to 7 Yrs",
        "Job Description": "Company Description\n\nVyshnavi Information Technologies (India) Private Limited (VIT) is an ISO 9001:2015 Certified Software Product Development and Services Company. Established in 2001, VIT is a global Information Technology company. VIT's primary business has been in providing technology services to renowned customers who are largely into product development. Our range of Services includes Design, Development and Testing of Software components for Product Companies, turn-key Software Solutions for Retail, e-Governance, Utility, Facilities, and Mining Industries.\n\nRole Description\n\nThis is a full-time on-site role in Bengaluru for a Business Development Manager- IT. The Business Development Manager- IT will be responsible for identifying potential customers, negotiating deals, and managing client relationships.\n\nQualifications\n Bachelor's degree or higher in business, marketing, or a related field\n 3+ years of experience in business development or sales in IT sector with a strong. focus on technology and services\n Demonstrated ability to identify and qualify sales leads, develop client relationships, and negotiate deals\n Excellent communication skills, with the ability to effectively communicate with both technical and non-technical audiences\n Experience with CRM software and Salesforce\n Ability to work independently and effectively in a team environment\n Proven track record of meeting or exceeding sales targets and revenue goals\n\nAny offer of employment is conditioned upon the successful completion of a background investigation,"
    },
    {
        "Job Title": "IT Infrastructure Analyst",
        "Company Name": "TechNerds Solutions",
        "Location": "All India",
        "Salary": "Not Disclosed",
        "Experience": "5 to 9 Yrs",
        "Job Description": "Job description\n\nLooking for level 2 tech / analyst resource in the IT Infra space\n\nRequirements:\n 5 to 7 year experience - IT Infra\n Ability to communicate in English spoken and written\n Understanding of security considerations, while working in IT Infra\n Understanding of IP TCP/UDP\n Working experience w/firewall\n Working experience w/switching layer 2/3\n Working experience w/Windows Server OS\n Working experience w/Linux OS\n Working experience w/O365 and Exchange\n Ability to learn and work new systems or applications\n\nSend us your resume tohidden_email,"
    },
    {
        "Job Title": "Inside Sales Executive(IT Solutions/Services)",
        "Company Name": "Pronix",
        "Location": "Hyderabad",
        "Salary": "Not Disclosed",
        "Experience": "1 to 5 Yrs",
        "Job Description": "Posted On: 31 Mar 2024\n\nJob Type: Full Time\n\nCountry: INDIA\n\nLocation: Hyderabad, India or Remote\n\nNo of Positions: 10\n\nSkills\n\nThis is 100% onsite role to work from our Hyderabad, India office in IST nightshift.\n\nRequired Skills: CRM Tools, Sales Prospecting Life Cycle, Software Development Process, Techology Services Awareness (Digital, Cloud, Data, Integration, ERP/CRM, Agile, Digital Solution and Software Applications Development, Offshore/Onsite IT Service Delivery), IT Staffing/Talent Solutions,IT C-Level Executives(CXO/VP/Director Level), Trainable, Coachable, Self Learner, Hunter/Go-Getter, Customer Focused,\n\nWE'RE SEEKING A CANDIDATE WHO POSSESSES EXPERIENCE IN DIRECT SALES OF IT SOLUTIONS AND SERVICES, SPECIFICALLY WITHIN A HUNTING ROLE, IN THE U.S. MARKET.\n\n Minimum 1-5+ years of experience in IT Solutions/Services/Staffing Sales as Business Development/IT Sales Executive for acquiring new direct clients in US/Canada/Europe/Australian markets.\n\nJob Description\n Identify, contact and develop viable business accounts in order to create new business revenue streams from enterprise clients.\n Penetrate client accounts by leveraging internal relationships in an effort to get additional business and grow the accounts.\n Should have worked in areas of IT Solutions, Software Development Outsourcing, IT Staffing, Talent Solutions, Digital Solutions and Services.\n Should have owned staffing as a business center and held highly responsible and accountable for PL, business objectives, and targets.\n Responsibilities include, but not limited to: should be holding/capable of getting direct clients and opportunities right across.\n Should have excellent network in the industry and should be able to source profiles from non-conventional channels of recruitment.\n Should have strong US IT Sales background with US based clients. Primary KPI would be generating revenue and ensuring timely deliverables.\n Responsible to work closely with sales and account managers to keep a close watch on the gaps, expectation of the client(s), progress of the process, and prioritizing the requirements.\n Proactive in planning and strategizing timely delivery of talent as per business demand.\n Target oriented with ability to work in high pressure environment, multi- tasking, and self- motivated.\n Should have prior experience in handling clients and implementation partners.\n Must have hands-on experience in market research to generate new leads\n\nWorking Hours: Dayshift(2PM-11PM IST) or Nightshift in IST\n\nCTC: Excellent Salary + Benefits+ Sales inventive(as per new client accounts closed)/+ Commissions(as per revenue targets achieved).\n\nIf you seek a rewarding opportunity in an emerging technology-focused business, you may be the executive to join our team. Pronix has experienced tremendous growth and is looking for a result driven Staffing Sales and Business Development professional who can lead the Sales for the IT Services and Digital Talent/Staffing Solutions Business Unit.\n\nIf you are interested/available for this job, please email with your latest resume directly athidden_emailor call me at +hidden_mobile.,"
    },
    {
        "Job Title": "Associate IT Pillar Specialist",
        "Company Name": "McDermott International, Ltd",
        "Location": "Chennai",
        "Salary": "Not Disclosed",
        "Experience": "2 to 6 Yrs",
        "Job Description": "Job Description\n\nCompany Overview:\n\nPeople power our future. That is why advancing a dynamic, inclusive environment, where everyone grows and thrives is critically important to us.\n\nOur ingenuity fuels daily life. Together, weve forged some of the most trusted partnerships across the energy value chain to make what was once just an idea a reality: laying subsea infrastructure thousands of feet below sea level, installing offshore platforms hundreds of miles from shore, and using our expertise to design and build offshore wind infrastructure.\n\nFor more than 100 years, we've been making the impossible possible. Today, we're driving the energy transition with more than 30,000 of the brightest minds across 54 countries.\n\nHere, what you do matters.\n\nJob Overview:\n\nThe Associate IT Pillar Specialist is responsible for utilizing existing IT Pillar procedures to solve routine or standard problems. They receive instruction, guidance, and direction from others within the team, and they will leverage their conceptual knowledge of theories, practices, and procedures related to IT Pillar and Information Technology.\n\nResponsibilities\n\nKey Tasks and Responsibilities:\n Provide user support to engineering, procurement, and site/construction\n Communicate with internal users of the application to address and solve users business and application needs\n Write functional specifications, design, and test developed reports, and assist with user training\n Serve as functional lead and or PM on IT Projects\n Work closely with the various business units during the upgrade of Smart Plant Materials and then provide follow-up support\n Assist the process owner in analyzing, clarifying, and documenting the work process\n Solve user problems and identify other areas of opportunity\n\nQualifications\n\nEssential Qualifications and Education:\n Bachelors degree in Engineering, Computer Science, or related field\n Minimum 2+ years of experience in IT supporting one or more applications\n An understanding of engineering, procurement, and construction processes in executing an EPC project\n Strong skills in the following areas: communication, developing and documenting requirements and specifications, development, and planning of processes to solve the users business and application needs, and IT project management methodology\n Working knowledge of 3D CAD engineering design, materials management, and project controls applications is also desirable\n Working knowledge of the business units or processes supported by the application\n In-depth understanding of how the application software has been set up and integrated to support business needs\n Ability to conduct functional testing of the application\n Complete understanding of data use, processes, and output\n Good communication skills are a must,"
    },
    {
        "Job Title": "Business Development Executive (IT Staffing and Software Development)",
        "Company Name": "Technokrate Technologies",
        "Location": "Other Maharashtra",
        "Salary": "Not Disclosed",
        "Experience": "1 to 5 Yrs",
        "Job Description": "Profile : Business Development Executive (IT Staffing and Software Development)\nExperience : 1-3 years\nLocation : Nagpur\n\nJob Description :\n Identify and develop new business opportunities in the IT staffing and software development markets.\n Generate leads through various channels such as networking, cold calling, email campaigns, and social media.\n Conduct market research to identify potential clients and understand their staffing and software development needs.\n Build and maintain strong, long-lasting relationships with clients to ensure a high level of customer satisfaction.\n Understand clients business needs and present tailored solutions that align with their goals.\n Conduct regular follow-ups with clients to ensure ongoing satisfaction and address any issues promptly.\n\nJob Type: Full-time\n\n\nEducation:\n Bachelor's (Required)\n\nExperience:\n Business development: 1 year (Required)\n total work: 1 year (Required)\n\nLanguage:\n English (Required)\n\nWork Location: In person,"
    },
    {
        "Job Title": "IT Sales Manager-Bhopal",
        "Company Name": "Adhaan Solution Pvt. Ltd.",
        "Location": "Other Madhya Pradesh",
        "Salary": "Not Disclosed",
        "Experience": "6 to 10 Yrs",
        "Job Description": "Position Summary:\n\nThe IT Sales Manager will be responsible for driving sales of hardware products, specifically CCTV systems and firewalls. This role involves developing and executing strategic sales plans, identifying new business opportunities, maintaining relationships with existing clients, and ensuring customer satisfaction. The ideal candidate will have a strong background in IT hardware sales, excellent communication skills, and a proven track record of meeting or exceeding sales targets.\n\nKey Responsibilities:\n Sales Strategy and Execution:\n Develop and implement sales strategies to achieve organizational sales goals and revenues.\n Identify target markets and conduct market research to understand customer needs and competitive landscape.\n Plan and oversee advertising and promotional campaigns.\n Client Management:\n Build and maintain long-term relationships with clients.\n Identify and develop new business opportunities through networking and market research.\n Provide pre-sales technical assistance and product education to potential customers.\n Deliver presentations and demonstrate products to customers.\n Sales Operations:\n Prepare sales contracts ensuring adherence to law-established rules and guidelines.\n Report on sales activities and progress towards targets.\n Ensure the timely and successful delivery of solutions according to customer needs and objectives.\n Team Collaboration:\n Work closely with the marketing team to develop promotional materials and campaigns.\n Collaborate with technical support and product development teams to address customer requirements and feedback.\n Train and mentor junior sales staff as needed.\n Performance Management:\n Monitor and analyze sales performance metrics.\n Prepare regular reports and forecasts for senior management.\n Stay up-to-date with industry trends, market activities, and competitors.\n\nQualifications:\n Education and Experience:\n Bachelors degree in Business, Marketing, IT, or a related field.\n Minimum of 6 years of experience in IT hardware sales, specifically in CCTV and firewall products.\n Proven track record of achieving sales targets and driving growth.\n Skills and Competencies:\n Strong understanding of CCTV and firewall products and their applications.\n Excellent communication, negotiation, and presentation skills.\n Ability to develop and maintain relationships with clients.\n Strong organizational and time management skills.\n Proficiency in CRM software and Microsoft Office Suite.\n\nJob Type: Full-time\n\n\nWork Location: In person,"
    },
    {
        "Job Title": "Manager, IT - Engineering",
        "Company Name": "Flowserve Corporation",
        "Location": "Chennai",
        "Salary": "Not Disclosed",
        "Experience": "5 to 9 Yrs",
        "Job Description": "Role Summary:\n\nWe are seeking a highly skilled and experienced IT Manager to lead our Engineering Systems team in India. This position reports to the IT Vice-President in the U.S. The ideal candidate will have extensive experience managing and supporting engineering systems (including Windchill, CAD tools, and others) in an industrial manufacturing environment. As an IT Manager, you will oversee the support and enhancement of our engineering systems, ensuring they meet the needs of our pump, valve, and seal manufacturing operations.\n\nKey Responsibilities:\n\nEngineering Systems Management:\n Oversee the implementation, maintenance, and support of engineering systems, including Windchill.\n Ensure engineering systems are optimized for performance, reliability, and scalability.\n Work Closely with the Global IT Project Team on their initiatives, which includes managing deployments to the production system.\n Work closely with engineering and manufacturing teams to understand their needs and translate them into system requirements.\n Manage system upgrades, patches, and enhancements to ensure they align with business objectives.\n\nTeam Leadership:\n Lead and manage a team of IT professionals responsible for supporting engineering systems.\n Foster a collaborative team environment, promoting professional growth and development.\n Set performance goals, conduct regular performance reviews, and provide constructive feedback.\n Recruit, train, and mentor IT staff, building a high-performing team.\n\nProject Management:\n Lead and manage IT projects related to engineering systems, ensuring timely delivery within budget and scope.\n Develop and maintain detailed project plans, timelines, and budgets.\n Coordinate with cross-functional teams to ensure seamless project execution.\n Identify and mitigate project risks, ensuring successful project outcomes.\n\nTechnical Expertise:\n Provide technical guidance and support to the team, troubleshooting complex issues as needed.\n Ensure the implementation of best practices in system administration, security, and operations.\n Stay abreast of the latest engineering system technologies and trends, ensuring the company remains at the forefront of industry advancements.\n\nStakeholder Communication:\n Communicate effectively with stakeholders at all levels, translating technical concepts into clear, actionable insights.\n Prepare and deliver high-quality presentations to senior management, clients, and other stakeholders.\n Facilitate meetings and workshops, ensuring clear communication and productive outcomes.\n\nStrategic Planning:\n Collaborate with senior management to develop and execute the IT strategy for engineering systems, aligning with overall business objectives.\n Identify opportunities for process improvements and drive the implementation of innovative solutions.\n Monitor industry trends and assess their potential impact on the organization, making strategic recommendations.\n\nRequirement:\n Bachelors degree in Information Technology, Computer Science, Engineering, or a related field. A Masters degree or relevant certifications (e.g., PMP, ITIL, Windchill certification) is a plus.\n Proven experience (5+ years) in IT management, with a strong track record of supporting engineering systems in an industrial manufacturing environment.\n Demonstrated expertise in managing Windchill, CAD Tools, and other engineering systems.\n Exceptional communication and presentation skills, with the ability to convey complex information clearly and concisely.\n Strong leadership skills, with the ability to inspire and motivate a team.\n In-depth knowledge of IT infrastructure, security, and operations.\n Proficiency in relevant software and tools (e.g., MS Office, project management software, ITSM tools).\n US Travel Visa - nice to have\n\nPersonal Attributes:\n Strong analytical and problem-solving skills.\n Ability to work under pressure and manage multiple priorities.\n High level of integrity and professionalism.\n Excellent interpersonal skills, with the ability to build and maintain strong relationships.\n\nReq ID : R-11116\n\nJob Family Group : Information Technology\n\nJob Family : IT Information Systems Operations\n\n\nIf you are a qualified individual with a disability or a disabled veteran, you have the right to request a reasonable accommodation if you are unable or limited in your ability to use or access flowservecareers.com as result of your disability. You can request a reasonable accommodation by sending an email tohidden_emailorder to quickly respond to your request, please use the words \"Accommodation Request\" as your subject line of your email. For more information, read the Accessibility Process.,"
    },
    {
        "Job Title": "IT Project Manager/Onsite Business Partner- Chennai Site",
        "Company Name": "Qualcomm",
        "Location": "Chennai",
        "Salary": "Not Disclosed",
        "Experience": "2 to 8 Yrs",
        "Job Description": "Company:\nQualcomm India Private Limited\n\nJob Area:\nInformation Technology Group, Information Technology Group > IT Management\n\nGeneral Summary:\n\nQualcomm's OneIT organization is looking for an experienced professional with strong technical expertise, project management skills, and stakeholder management skills to lead our Site IT Operations in Chennai.\n\nThe ideal candidate would be a seasoned technology project manager with primary focus on Site specific stakeholder management, projects/implementation skills .\n\nAs the face of IT at the Chennai office, this role offers to lead a matrix managed team of SMEs to drive site specific operational needs while extensively collaborating with Global Engineering stakeholders, end users, IT Infrastructure, Cybersecurity, Enterprise Applications teams\n\nResponsibilities:\n As Site IT Leader, this role is ITs face at the Site Leadership partnering with the Chennai R&D / Engineering teams and manage, coordinate, and support all the site-specific IT Infrastructure & Engineering services, resources, and solutions.\n This role is to ensure that all the IT related needs are being met in an efficient manner, allowing engineering to focus more on their overall business and strategy and commitments are not hindered by a lack of any Qualcomm IT resources or expertise.\n The person in role needs to collaborate extensively with various other functional IT orgs like Server, Storage, Networking, and end user services to ensure stable IT Infrastructure. In addition, this role will be responsible to inform the business units of IT systems, processes, resources, and changes that may help optimize site specific engineering projects, processes, and operations.\n Demonstrated experience in end-to-end software development lifecycle: design, developing, debugging, test planning/validating, optimization, customer-Stakeholder engagement and production support.\n Contributing to process improvements, innovating project management, and increasing PMO maturity objectives (e.g., standardized tools, templates, and processes).\n Creating work breakdown structure (WBS), identifying internal/external dependencies, defining task effort and duration estimates and tracking project schedule.\n The person in role would participate in local engineering site leadership meetings to present the monthly metrics on utilization, project updates and understand the upcoming engineering roadmap and plan for any IT related changes, upgrades or capacity expansions that are needed to enable the business.\n Lead and manage the existing IT team in Chennai including Engineering IT and end-user service engineers.\n Analytical ability identifying risks at the project and team level. Engaging stakeholders and senior management for risk mitigation or escalation\n Agile/Scrum processes and hybrid-application of multiple project management methodologies.\n Creating and Usage of JIRA and service now dashboards\n PMP and Agile/Scrum Master Certification is a plus\n Additional site-specific responsibilities include:\no Connect with the engineering directors and support partners at Chennai to understand the roadmaps and demands of OneIT for proper planning and execution.\no Establish and report Chennai IT Operational Metrics on a monthly cadence.\no Partner with Facilities, Business Operations, Lab operations and Logistics teams to support site needs.\no Work in a matrix environment and provide the necessary local support by leveraging the IT Ops teams and other IT global support resources.\no Be ITs single point of contact for Chennai engineering for any escalations and/or elevated support as necessary to void/minimize the critical business impact\n\nMinimum Qualifications:\n 6+ years of IT-related work experience with a Bachelor's degree.\nOR\n8+ years of IT-related work experience without a Bachelors degree.\n\n 2+ years of experience leading projects/programs.\n\nApplicants: Qualcomm is an equal opportunity employer. If you are an individual with a disability and need an accommodation during the application/hiring process, rest assured that Qualcomm is committed to providing an accessible process. You may e-mailhidden_emailor call Qualcomm's toll-free number found here. Upon request, Qualcomm will provide reasonable accommodations to support individuals with disabilities to be able participate in the hiring process. Qualcomm is also committed to making our workplace accessible for individuals with disabilities.\n\nQualcomm expects its employees to abide by all applicable policies and procedures, including but not limited to security and other requirements regarding protection of Company confidential information and other confidential and/or proprietary information, to the extent those requirements are permissible under applicable law.\n\nTo all Staffing and Recruiting Agencies: Our Careers Site is only for individuals seeking a job at Qualcomm. Staffing and recruiting agencies and individuals being represented by an agency are not authorized to use this site or to submit profiles, applications or resumes, and any such submissions will be considered unsolicited. Qualcomm does not accept unsolicited resumes or applications from agencies. Please do not forward resumes to our jobs alias, Qualcomm employees or any other company location. Qualcomm is not responsible for any fees related to unsolicited resumes/applications.\n\nIf you would like more information about this role, please contact Qualcomm Careers.,"
    },
    {
        "Job Title": "IT Sales Manager",
        "Company Name": "Edgeconnect global Pvt.Ltd.",
        "Location": "Noida",
        "Salary": "Not Disclosed",
        "Experience": "2 to 6 Yrs",
        "Job Description": "Hi,\n\nUrgent opening for IT sales manager.\n\nCandidate should have good exp of Selling IT services like website designing and app development.\n\nCandidate with minimum 2 years of exp require in the relevant field.\n\nExposure of international market is must.\n\nImmediate joiner require.\n\nDrop your cv to get call\n\nJob Types: Full-time, Permanent\n\n\nJadwal:\n Day shift\n\nExperience:\n IT Sales: 2 years (Preferred)\n\nWork Location: In person,"
    },
    {
        "Job Title": "IT Support Engineer",
        "Company Name": "Dhyey Consulting",
        "Location": "Other Gujarat",
        "Salary": "Not Disclosed",
        "Experience": "2 to 6 Yrs",
        "Job Description": "Job Responsibilities\n Efficiently resolve computer problems, from hardware issues to software glitches, to ensure minimal disruptions and assist employees effectively.\n Set up, configure, and maintain computers and software, ensuring they are up to date.\n Ensure the company's computer network, including routers and firewalls, is secure and functioning correctly.\n Keep organized records of IT equipment, software licenses, and create easy-to-follow guides for common problems.\n Implement and enforce security measures, including user access controls, antivirus software, and data backups.\n Provide training to employees on how to use IT resources effectively and safely.\n Communicate with external vendors and service providers to resolve technical problems and acquire necessary IT equipment and services.\n Help in purchasing IT hardware and software that aligns with the company's needs and budget.\n Installing and updating office applications, teams troubleshooting.\n Overview of. Active Directory users and computers.\n knowledge of firewall functionality\n configure network routers,"
    },
    {
        "Job Title": "US IT Recruiter",
        "Company Name": "Pinnacle Group, Inc.",
        "Location": "All India",
        "Salary": "Not Disclosed",
        "Experience": "2 to 6 Yrs",
        "Job Description": "About Pinnacle Group:\n\nPinnacle Group is a leading provider of workforce solutions and managed services. We specialize in delivering innovative solutions to meet the evolving needs of businesses, empowering organizations to optimize their workforce and achieve operational excellence!\n\nJob Summary:\n\nPinnacle Group is looking for a dedicated recruiter to manage the full life cycle of recruiting from inception to offer delivery. You will work on W2 IT requirements for high-volume accounts, source candidates for strategic contract roles, and build talent pipelines for future opportunities. The role involves conducting intake meetings, screening resumes, and interviewing candidates, as well as utilizing AI tools and VMS systems for candidate tracking.\n\nJob Description:\n Full life cycle recruiting from inception to offer delivery\n Experience working on W2 IT Requirements for high volume accounts\n Conduct intake meetings with clients to agree on qualification criteria for candidates\n Source for various different strategic accounts, largely on contract basis\n Screen resumes and job applications\n Create talent pipelines with high-potential candidates for future job opportunities\n Interview candidates and provide shortlists of qualified potential hires\n Publish job ads on careers pages, job boards and social media\n Prepare candidates before interviews with clients\n Build relationships with Account Managers, Recruiters, and potential IT resources\n Utilize cutting-edge AI like Sense messaging to keep in touch with consultants and candidates\n Utilize Bullhorn ATS and other VMS tools like Fieldglass, Beeline, and Simplify for consultant and candidate tracking\n Join daily meetups with recruiting team to discuss open requisitions and hot positions\n Submit 8-10 resources per week to client when approved by Account/Delivery Manager\n Display professionalism and consistency on a day-to-day basis, as you are asked to represent Pinnacle Group at its best\n\nRequirements:\n Relevant experience in agency IT contract staffing space\n Reliable network connectivity and work from home environment\n Bachelors degree from an accredited university\n Strong written and verbal communication skills,"
    },
    {
        "Job Title": "It Service Desk Executive",
        "Company Name": "M/S MIG DOOR VISAS IMMIGRATION",
        "Location": "Chennai",
        "Salary": "Rs 40  - 50 Lakh/Yr",
        "Experience": "1 to 6 Yrs",
        "Job Description": "Technical Support:Provide timely and effective technical support to end-users via phone, email, or in-person interactions. Troubleshoot hardware and software issues, guiding users through problem-solving processes. | Incident Management:Log all incoming requests and incidents into the service desk system. Prioritize and categorize incidents based on severity and impact on business operations. | Communication:Maintain clear communication with users throughout the incident resolution process. Update users on the status of their requests and provide follow-up as necessary. | Documentation:Create and maintain documentation related to common issues, solutions, and procedures to enhance knowledge sharing within the team. | Collaboration:Work closely with other IT teams (e.g., network support, application support) to escalate complex issues that require specialized expertise."
    },
    {
        "Job Title": "IT sales & marketing manager",
        "Company Name": "Fusion TechLab",
        "Location": "Other West Bengal",
        "Salary": "Not Disclosed",
        "Experience": "4 to 8 Yrs",
        "Job Description": "Company Description\n\nFusion TechLab is a reputable brand providing full-featured, secure, and attractive website development services to global customers at lucrative seasonal discounts. We can provide all the essential features you need for a simple business website, recharge website, shopping site, blog, or anything else.\n\nRole Description\n\nThis is a full-time on-site role located in Kolkata metropolitan area for an IT Sales and Marketing Manager. The IT Sales and Marketing Manager will be responsible for developing and executing comprehensive marketing and sales strategies to drive revenue growth and market share. They will also be responsible for managing end-to-end sales cycles, collaborating with cross-functional teams, preparing regular reports, conducting market research, and building and nurturing relationships with clients.\n\nQualifications\n 4+ years of experience in IT sales and marketing\n Proven sales track record with demonstrated ability to deliver results\n Excellent. communication and negotiation skills\n Strong analytical and organizational abilities\n Working knowledge of CRM software and digital marketing tools\n Bachelor's degree or equivalent experience in marketing, business, or a related field\n Experience in website development services is a plus\n Experience in leading a sales team is a plus\n Experience in working in the Kolkata metropolitan area market is a plus,"
    },
    {
        "Job Title": "IT Recruiters",
        "Company Name": "System Soft Technologies",
        "Location": "Hyderabad",
        "Salary": "Not Disclosed",
        "Experience": "2 to 6 Yrs",
        "Job Description": "Company Description\n\nSystem Soft is an IT service management company based in Hyderabad. We provide IT consulting services and solutions to help businesses achieve their technology goals. Our innovative technology solutions and deep expertise help enhance business agility and competitiveness. We prioritize building long-term client relationships as a trusted advisor and invest in predicting unique business needs to ensure powerful ROI and growth.\n\nRole Description\n\nThis is a full-time on-site role for an IT Recruiter. The IT Recruiter will be responsible for full-life cycle recruiting, technical recruiting, and hiring qualified IT professionals. The IT Recruiter will work closely with hiring managers to understand business needs and ensure timely and effective staffing solutions.\n\nQualifications\n Experience in full-life cycle recruiting, IT recruitment, and technical recruiting\n Ability to manage multiple hiring processes simultaneously\n Excellent communication and interpersonal. skills\n Ability to work collaboratively with hiring managers and other team members\n Strong analytical and problem-solving skills\n Bachelors degree in Human Resources, Business Administration, or related field\n Experience with applicant tracking systems and other recruiting tools,"
    },
    {
        "Job Title": "IT  Sales Manager",
        "Company Name": "Agmatel India Pvt Ltd",
        "Location": "Delhi",
        "Salary": "Not Disclosed",
        "Experience": "5 to 9 Yrs",
        "Job Description": "We are hiring IT Manager Sales (IT System Integrated services) for Agmatel India Pvt.Ltd.\n\nQualifications: Graduate Engineers B. Tech/B. E(Computer Science.)/MCA/BCA/B.Sc.(IT), Diploma DET in IT/ CS/ Fresher can also apply\n\nNote: Candidate who have completed MBA in Sales & Marketing shall be preferred for this role.\n\nExperience: 5+Years must have experience in IT system Integrated services company\n\nJob Location: New Delhi\n\nSalary: As per Market standard\n\nEmployment Type: Full-time\n\nIndustry: Information Technology & Services\n\nEmployment Type: Full-time\n\nJob Responsibilities:\n Providing training and professional development to the sales team\n Creating sales goals and implementing initiatives to increase sales\n Assisting sales team members to build quality relationships with customers\n Collaboration with other company departments, such as marketing or finance, to offer customer support\n Developing strategies for increasing market share\n Ensuring that sales team members follow up. with potential customers\n Generating reports and data for sales analysis\n Handling escalated client objections and concerns to support other members of the sales team\n\nInterested candidates share their CV onhidden_emailor call onhidden_mobile,"
    },
    {
        "Job Title": "Chartered Accountant - IT Taxation Specialist",
        "Company Name": "WORKQUEST GLOBAL PRIVATE LIMITED",
        "Location": "Other Gujarat",
        "Salary": "Not Disclosed",
        "Experience": "3 to 7 Yrs",
        "Job Description": "Chartered Accountant (CA) - IT Taxation Specialist\n\nJob Type: Full-time\n\nJob Description\n\nWe are seeking a highly skilled and motivated Chartered Accountant with expertise in IT taxation to join our team. The ideal candidate will possess excellent language control, particularly in English, and should have a successful track record in handling direct tax litigations, return filing, and corporate taxation. The candidate must have cleared the CA exam in the first attempt and demonstrated proficiency in researching and analyzing case laws related to IT taxation.\n\nResponsibilities\n Direct Tax Litigations:\n Handle direct tax litigations efficiently, drawing on first-hand experience gained during article ship or in the current role.\n Represent the organization in tax-related legal matters and liaise with external legal counsel when necessary.\n Return Filing and Corporate Taxation:\n Manage the entire process of return filing, ensuring accuracy and compliance with relevant tax. regulations.\n Provide expertise in corporate taxation, including advising on tax planning strategies and compliance matters.\n Research and Case Law Analysis:\n Conduct thorough research on IT taxation laws and regulations.\n Search for relevant case laws and analyze their implications on current and future tax strategies.\n Articulate research findings in submission and write-up formats for use in legal proceedings.\n Language Control:\n Demonstrate strong language control, particularly in English, for effective communication in written and verbal forms.\n Qualifications and Experience:\n Completed CA exam in the first attempt.\n Proven experience in direct tax litigations, return filing, and corporate taxation.\n Proficient in searching case laws and conducting tax-related research.\n Recommendations:\n Provide credible recommendations from previous employers attesting to the candidate's skills, performance, and professionalism,"
    },
    {
        "Job Title": "IT Sales Associate",
        "Company Name": "Prudent Tech IT Solutions",
        "Location": "Other Maharashtra",
        "Salary": "Not Disclosed",
        "Experience": "2 to 6 Yrs",
        "Job Description": "Company Description\n\nPrudent Tech IT Solutions is a leading technology company based in Mumbai, specializing in app development, web development, and IoT solutions for businesses worldwide. Our experienced team of developers creates innovative, user-friendly applications using the latest technologies to enhance business operations. We focus on quality, reliability, and security to help our clients succeed in the competitive digital landscape.\n\nRole Description\n\nThis is a full-time on-site role for an IT Sales Associate at Prudent Tech IT Solutions in Mumbai. The IT Sales Associate will be responsible for developing sales strategies, prospecting new clients, presenting IT solutions, negotiating contracts, and maintaining customer relationships. They will work closely with the sales team and technical experts to meet sales targets and contribute to the company's growth.\n\nQualifications\n Strong Sales, Negotiation, and Communication skills\n Knowledge of IT solutions and technologies\n Experience in B2B sales or IT sales\n Ability to understand client requirements and propose suitable solutions\n Excellent customer service and relationship-building skills\n Self-motivated and target-driven mindset\n Bachelor's degree in Business, IT, or related field\n Certifications in Sales or IT Sales are a plus\n Prior experience in Door to Door sales,"
    },
    {
        "Job Title": "ROLE  Bench Sales Manager - US IT Recruitment",
        "Company Name": "Avtech Software Services (I) Pvt Ltd",
        "Location": "Chennai",
        "Salary": "Not Disclosed",
        "Experience": "8 to 12 Yrs",
        "Job Description": "Job Title: Bench Sales Manager - US IT Recruitment\n\nLocation: Chennai\n\nExperience: 8 to 11 years\n\nJob Description:\n\nThe Bench Sales Manager will be responsible for leading a team of bench sales recruiters and driving revenue growth through the acquisition and placement of IT consultants on various projects across the United States. The ideal candidate will possess a strong background in US IT recruitment, exceptional leadership skills, and a proven track record of meeting and exceeding sales targets.\n\nKey Responsibilities:\n Leadership and Team Management:\n Provide leadership, guidance, and mentorship to a team of bench sales recruiters.\n Set clear performance objectives and KPIs for the team and ensure they are met or exceeded.\n Conduct regular performance evaluations and provide constructive feedback to team members.\n Foster a culture of collaboration, excellence, and continuous improvement within the team.\n Business Development:\n Develop and implement strategic sales plans to. drive revenue growth and expand the client base.\n Identify new business opportunities and build strong relationships with existing and potential clients.\n Collaborate with the sales team to develop customized solutions and proposals to meet client needs.\n Stay updated on industry trends, market conditions, and competitor activities to identify potential business opportunities.\n Consultant Acquisition and Placement:\n Oversee the acquisition and placement of IT consultants on various projects nationwide.\n Utilize various sourcing techniques, including job boards, networking, social media, and referrals, to identify qualified candidates.\n Conduct thorough screening and interview processes to assess candidate qualifications, skills, and suitability for client projects.\n Negotiate competitive rates and terms with consultants and clients to ensure successful placements.\n Performance Tracking and Reporting:\n Track and analyze sales performance metrics, including revenue, pipeline, conversion rates, and client satisfaction.\n Prepare regular reports and presentations for senior management on sales performance, market trends, and business development activities.\n Identify areas for improvement and implement strategies to optimize sales performance and achieve targets.\n\nQualifications:\n Bachelors degree in business administration, Marketing, or a related field.\n 5+ years of experience in US IT recruitment, with a focus on bench sales.\n Proven track record of meeting and exceeding sales targets in the staffing industry.\n Strong leadership skills with the ability to motivate and inspire a team.\n Excellent communication, negotiation, and interpersonal skills.\n Ability to thrive in a fast-paced, deadline-driven environment.\n Proficiency in MS Office Suite and CRM software.\n\nSend Mail to :hidden_email,"
    }
]